sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/*!
    \file    gd32a7xx_rcu.h
    \brief   definitions for the RCU

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_RCU_H
#define GD32A7XX_RCU_H

#include "gd32a7xx.h"


/* RCU definitions */
#define CCTL                            RCU_BASE                                               /*!< CCTL base address */
#define RCTL                            RCU_BASE+0x2C00U                                       /*!< RCTL base address */
                                                                                         
/* CCTL registers definitions */                                                         
#define RCU_CTL                         REG32(CCTL + 0x00000000U)                              /*!< control register */
#define RCU_CFG0                        REG32(CCTL + 0x00000004U)                              /*!< clock configuration register 0 */
#define RCU_INT                         REG32(CCTL + 0x00000008U)                              /*!< clock interrupt register */
#define RCU_AHBEN                       REG32(CCTL + 0x00000014U)                              /*!< AHB enable register */
#define RCU_APB2EN                      REG32(CCTL + 0x00000018U)                              /*!< APB2 enable register */
#define RCU_APB1EN                      REG32(CCTL + 0x0000001CU)                              /*!< APB1 enable register */
#define RCU_BDCTL                       REG32(CCTL + 0x00000020U)                              /*!< backup domain control register */
#define RCU_APB2EN_ADD                  REG32(CCTL + 0x00000024U)                              /*!< APB2 enable additional register */
#define RCU_AHBEN_ADD                   REG32(CCTL + 0x00000028U)                              /*!< AHB enable additional register */
#define RCU_CFG1                        REG32(CCTL + 0x0000002CU)                              /*!< clock configuration register 1 */
#define RCU_CFG2                        REG32(CCTL + 0x00000030U)                              /*!< clock configuration register 2 */
#define RCU_CFG3                        REG32(CCTL + 0x00000034U)                              /*!< clock configuration register 3 */
#define RCU_PLLLOL                      REG32(CCTL + 0x00000038U)                              /*!< PLL loss of lock register */
#define RCU_CKDCTL                      REG32(CCTL + 0x0000003CU)                              /*!< Clock detect control register */
#define RCU_CKFMCTL(ckfmx)              REG32(((CCTL) + 0x40U) + 0x10U * (ckfmx))              /*!< Clock frequency monitor control register */
#define RCU_CKFMRCCFG(ckfmx)            REG32(((CCTL) + 0x44U) + 0x10U * (ckfmx))              /*!< Clock frequency monitor reference count configuration register */
#define RCU_CKFMHTHCFG(ckfmx)           REG32(((CCTL) + 0x48U) + 0x10U * (ckfmx))              /*!< CKFM high threshold configuration register */
#define RCU_CKFMLTHCFG(ckfmx)           REG32(((CCTL) + 0x4CU) + 0x10U * (ckfmx))              /*!< CKFM low threshold configuration register */
#define RCU_BUSIM_TMR                   REG32(CCTL + 0x00000090U)                              /*!< CCTL TMR register */
#define RCU_PLLFRA                      REG32(CCTL + 0x00000098U)                              /*!< PLL fraction configuration register */
#define RCU_PLLSSCTL                    REG32(CCTL + 0x0000009CU)                              /*!< PLL clock spread spectrum control register */
                                                                                         
/* RCTL registers definitions */                                                         
#define RCU_SYSRSTSTAT                  REG32(RCTL + 0x00000000U)                              /*!< System reset status register */
#define RCU_BUSCTL                      REG32(RCTL + 0x00000004U)                              /*!< Bus control register */
#define RCU_SUBSERSTAT                  REG32(RCTL + 0x00000008U)                              /*!< Subsystem/external reset status register */
#define RCU_SUBSRCTL                    REG32(RCTL + 0x0000000CU)                              /*!< Subsystem reset control register */
#define RCU_SUBSRPACTL                  REG32(RCTL + 0x00000010U)                              /*!< Subsystem reset pin assert control register */
#define RCU_SUBSRMUCNT                  REG32(RCTL + 0x00000014U)                              /*!< Subsystem reset mode upgrade counter register */
#define RCU_SUBSRMUTH                   REG32(RCTL + 0x00000018U)                              /*!< Subsystem reset mode upgrade threshold register  */
#define RCU_SYSMRUTH                    REG32(RCTL + 0x0000001CU)                              /*!< System reset mode upgrade threshold register */
#define RCU_ERPACFG                     REG32(RCTL + 0x00000020U)                              /*!< External reset pin assert configuration register */
#define RCU_RDSMSTAT                    REG32(RCTL + 0x00000024U)                              /*!< Reset during standby mode status register */
#define RCU_SUBSRTO                     REG32(RCTL + 0x00000028U)                              /*!< Subsystem reset timeout register */
#define RCU_LPDBGSTAT                   REG32(RCTL + 0x0000002CU)                              /*!< Low power debug status register */
#define RCU_AHBRST                      REG32(RCTL + 0x00000030U)                              /*!< AHB reset register */
#define RCU_APB1RST                     REG32(RCTL + 0x00000034U)                              /*!< APB1 reset register */
#define RCU_APB2RST                     REG32(RCTL + 0x00000038U)                              /*!< APB2 reset register */
#define RCU_APB2RST_ADD                 REG32(RCTL + 0x0000003CU)                              /*!< APB2 reset additional register */
#define RCU_PORSTAT0                    REG32(RCTL + 0x00000040U)                              /*!< Power-on reset during POR watchdog overflows status register 0 */
#define RCU_PORSTAT1                    REG32(RCTL + 0x00000044U)                              /*!< Power-on reset during POR watchdog overflows status register 1 */
#define RCU_PORSTAT2                    REG32(RCTL + 0x00000048U)                              /*!< Power-on reset during POR watchdog overflows status register 2 */
#define RCU_PORSTAT3                    REG32(RCTL + 0x0000004CU)                              /*!< Power-on reset during POR watchdog overflows status register 3 */
#define RCU_TMRERRSTAT                  REG32(RCTL + 0x00000050U)                              /*!< Triple modular redundancy error status */
#define RCU_SYSRSTUCNT                  REG32(RCTL + 0x00000054U)                              /*!< System reset upgrade counter register */
#define RCU_SUBSRSTCNT                  REG32(RCTL + 0x00000058U)                              /*!< Subsystem reset counter register */
#define RCU_SYSRSTCNT                   REG32(RCTL + 0x0000005CU)                              /*!< System reset counter register */
#define RCU_SUBSRSTAD                   REG32(RCTL + 0x00000060U)                              /*!< Subsystem reset all disable register */

