sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* bits definitions */
/* RCU_CTL */
#define RCU_CTL_IRC48MADJ               BITS(3,7)                                              /*!< internal 48M RC oscillator clock trim adjust value */
#define RCU_CTL_IRC48MCALIB             BITS(8,15)                                             /*!< internal 48M RC oscillator calibration value */
#define RCU_CTL_HXTALEN                 BIT(16)                                                /*!< external high speed oscillator enable */
#define RCU_CTL_HXTALSTB                BIT(17)                                                /*!< external crystal oscillator clock stabilization flag */
#define RCU_CTL_HXTALBPS                BIT(18)                                                /*!< external crystal oscillator clock bypass mode enable */
#define RCU_CTL_CKMEN                   BIT(19)                                                /*!< HXTAL clock monitor enable */
#define RCU_CTL_LXTALSTBC               BIT(20)                                                /*!< clear LXTAL clock stabilization flag */
#define RCU_CTL_HXTALSCAL               BITS(22,23)                                            /*!< HXTAL frequency scale select */
#define RCU_CTL_PLLEN                   BIT(24)                                                /*!< PLL enable */
#define RCU_CTL_PLLSTB                  BIT(25)                                                /*!< PLL clock stabilization flag */
#define RCU_CTL_HXTALSTBC               BIT(28)                                                /*!< clear external crystal oscillator clock stabilization flag */
                                                                                    
/* RCU_CFG0 */                                                                      
#define RCU_CFG0_SCS                    BITS(0,1)                                              /*!< system clock switch */
#define RCU_CFG0_SCSS                   BITS(2,3)                                              /*!< system clock switch status */
#define RCU_CFG0_AHBPSC                 BITS(4,7)                                              /*!< AHB prescaler selection */
#define RCU_CFG0_APB1PSC                BITS(8,10)                                             /*!< APB1 prescaler selection */
#define RCU_CFG0_APB2PSC                BITS(11,13)                                            /*!< APB2 prescaler selection */
#define RCU_CFG0_PLLSEL                 BIT(16)                                                /*!< PLL clock source selection */
#define RCU_CFG0_PLLMF                  BITS(17,23)                                            /*!< PLL clock multiplication factor */
#define RCU_CFG0_CKOUT1SEL              BITS(24,26)                                            /*!< CKOUT clock source selection */
#define RCU_CFG0_PLLMF_7                BIT(27)                                                /*!< bit 7 of PLLMF */
#define RCU_CFG0_CKOUT1DIV              BITS(28,30)                                            /*!< CK_OUT divider which the CK_OUT frequency can be reduced */
#define RCU_CFG0_PLLDV                  BIT(31)                                                /*!< CK_PLL divide by 1 or 2 for CK_OUT0 */
                                                                                    
/* RCU_INT */                                                                       
#define RCU_INT_LXTALSTBIF              BIT(1)                                                /*!< LXTAL stabilization interrupt flag */
#define RCU_INT_HXTALSTBIF              BIT(3)                                                /*!< HXTAL stabilization interrupt flag */
#define RCU_INT_PLLSTBIF                BIT(4)                                                /*!< PLL stabilization interrupt flag */
#define RCU_INT_CKMIF                   BIT(7)                                                /*!< HXTAL clock stuck interrupt flag */
#define RCU_INT_LXTALSTBIE              BIT(9)                                                /*!< LXTAL stabilization interrupt enable */
#define RCU_INT_HXTALSTBIE              BIT(11)                                               /*!< HXTAL stabilization interrupt enable */
#define RCU_INT_PLLSTBIE                BIT(12)                                               /*!< PLL stabilization interrupt enable */
#define RCU_INT_LXTALSTBIC              BIT(17)                                               /*!< LXTAL stabilization interrupt clear */
#define RCU_INT_HXTALSTBIC              BIT(19)                                               /*!< HXTAL stabilization interrupt clear */
#define RCU_INT_PLLSTBIC                BIT(20)                                               /*!< PLL stabilization interrupt clear */
#define RCU_INT_CKMIC                   BIT(23)                                               /*!< HXTAL clock stuck interrupt clear */

/* RCU_AHBRST */
#define RCU_AHBRST_PARST                  BIT(0)                                              /*!< GPIOA reset */
#define RCU_AHBRST_PBRST                  BIT(1)                                              /*!< GPIOB reset */
#define RCU_AHBRST_PCRST                  BIT(2)                                              /*!< GPIOC reset */
#define RCU_AHBRST_PDRST                  BIT(3)                                              /*!< GPIOD reset */
#define RCU_AHBRST_PERST                  BIT(4)                                              /*!< GPIOE reset */
#define RCU_AHBRST_PFRST                  BIT(5)                                              /*!< GPIOF reset */
#define RCU_AHBRST_PGRST                  BIT(6)                                              /*!< GPIOG reset */
#define RCU_AHBRST_PHRST                  BIT(7)                                              /*!< GPIOH reset */
#define RCU_AHBRST_PIRST                  BIT(8)                                              /*!< GPIOI reset */
#define RCU_AHBRST_PJRST                  BIT(9)                                              /*!< GPIOJ reset */
#define RCU_AHBRST_PKRST                  BIT(10)                                             /*!< GPIOK reset */
#define RCU_AHBRST_PLRST                  BIT(11)                                             /*!< GPIOL reset */
#define RCU_AHBRST_PMRST                  BIT(12)                                             /*!< GPIOM reset */
#define RCU_AHBRST_PNRST                  BIT(13)                                             /*!< GPION reset */
#define RCU_AHBRST_DMA0RST                BIT(14)                                             /*!< DMA0 reset */
#define RCU_AHBRST_DMA1RST                BIT(15)                                             /*!< DMA1 reset */
#define RCU_AHBRST_DMAMUXRST              BIT(16)                                             /*!< DMAMUX reset */
#define RCU_AHBRST_QSPIRST                BIT(18)                                             /*!< QSPI reset */
#define RCU_AHBRST_CRCRST                 BIT(20)                                             /*!< CRC reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_AHBRST_MFCOMRST               BIT(21)                                             /*!< MFCOM reset */
#define RCU_AHBRST_MCMUARST               BIT(22)                                             /*!< MCMUA reset */
#define RCU_AHBRST_MCMUBRST               BIT(23)                                             /*!< MCMUB reset */
#define RCU_AHBRST_HWSEMRST               BIT(24)                                             /*!< HWSEM reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_AHBRST_HSMIFRST               BIT(25)                                             /*!< HSMIF reset */
#define RCU_AHBRST_IRMRST                 BIT(28)                                             /*!< IRM reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_AHBRST_IOCRST                 BIT(29)                                             /*!< IOC reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_AHBRST_STCMRST                BIT(30)                                             /*!< STCM reset */
#define RCU_AHBRST_MTCRST                 BIT(31)                                             /*!< MTC reset */
                                                                                         
/* RCU_APB2RST */                                                                        
#define RCU_APB2RST_SYSCFGRST             BIT(0)                                               /*!< System configuration reset */
#define RCU_APB2RST_LIN0RST               BIT(1)                                               /*!< LIN0 reset */
#define RCU_APB2RST_LIN1RST               BIT(2)                                               /*!< LIN1 reset */
#define RCU_APB2RST_LIN2RST               BIT(3)                                               /*!< LIN2 reset */
#define RCU_APB2RST_LIN3RST               BIT(4)                                               /*!< LIN3 reset */
#define RCU_APB2RST_LIN4RST               BIT(5)                                               /*!< LIN4 reset */
#define RCU_APB2RST_LIN5RST               BIT(6)                                               /*!< LIN5 reset */
#define RCU_APB2RST_ADC0RST               BIT(8)                                               /*!< ADC0 reset */
#define RCU_APB2RST_ADC1RST               BIT(9)                                               /*!< ADC1 reset */
#define RCU_APB2RST_TIMER0RST             BIT(10)                                              /*!< TIMER0 reset */
#define RCU_APB2RST_SPI0RST               BIT(11)                                              /*!< SPI0 reset */
#define RCU_APB2RST_TIMER7RST             BIT(12)                                              /*!< TIMER7 reset */
#define RCU_APB2RST_SPI4RST               BIT(16)                                              /*!< SPI4 reset */
#define RCU_APB2RST_SPI5RST               BIT(17)                                              /*!< SPI5 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB2RST_ADC2RST               BIT(18)                                              /*!< ADC2 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB2RST_TIMER19RST            BIT(19)                                              /*!< TIMER19 reset */
#define RCU_APB2RST_TIMER1RST             BIT(20)                                              /*!< TIMER1 reset */
#define RCU_APB2RST_TIMER5RST             BIT(21)                                              /*!< TIMER5 reset */
#define RCU_APB2RST_TIMER62RST            BIT(22)                                              /*!< TIMER62 reset */
#define RCU_APB2RST_CMP1RST               BIT(23)                                              /*!< CMP1 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB2RST_USART5RST             BIT(24)                                              /*!< USART5 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB2RST_SPI1RST               BIT(25)                                              /*!< SPI1 reset */
#define RCU_APB2RST_CMP0RST               BIT(26)                                              /*!< CMP0 reset */
                                                                                       
/* RCU_APB2RST_ADD */                                                                  
#define RCU_APB2RST_ADD_CAN0RST           BIT(8)                                               /*!< CAN0 cluster reset */
#define RCU_APB2RST_ADD_CAN1RST           BIT(9)                                               /*!< CAN1 cluster reset */
#define RCU_APB2RST_ADD_CAN2RST           BIT(10)                                              /*!< CAN2 cluster reset */
                                                                                       
/* RCU_APB1RST */                                                                      
#define RCU_APB1RST_TIMER20RST            BIT(0)                                               /*!< TIMER20 reset */
#define RCU_APB1RST_TIMER2RST             BIT(1)                                               /*!< TIMER2 reset */
#define RCU_APB1RST_TIMER60RST            BIT(2)                                               /*!< TIMER60 reset */
#define RCU_APB1RST_TIMER6RST             BIT(3)                                               /*!< TIMER6 reset */
#define RCU_APB1RST_WWDGT0RST             BIT(4)                                               /*!< WWDGT0 reset */
#define RCU_APB1RST_FWDGT0RST             BIT(5)                                               /*!< FWDGT0 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB1RST_SPI6RST               BIT(6)                                               /*!< SPI6 reset */
#define RCU_APB1RST_SPI7RST               BIT(7)                                               /*!< SPI7 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB1RST_I2C0RST               BIT(10)                                              /*!< I2C0 reset */
#define RCU_APB1RST_I2C1RST               BIT(11)                                              /*!< I2C1 reset */
#define RCU_APB1RST_BKPRST                BIT(12)                                              /*!< BKP reset */
#define RCU_APB1RST_DAC0RST               BIT(14)                                              /*!< DAC0 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB1RST_ENETRST               BIT(15)                                              /*!< ENET reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB1RST_TIMER61RST            BIT(16)                                              /*!< TIMER61 reset */
#define RCU_APB1RST_TIMER63RST            BIT(17)                                              /*!< TIMER63 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB1RST_SENTRST               BIT(18)                                              /*!< SENT reset */
#define RCU_APB1RST_LIN6RST               BIT(19)                                              /*!< LIN6 reset */
#define RCU_APB1RST_LIN7RST               BIT(20)                                              /*!< LIN7 reset */
#define RCU_APB1RST_LIN8RST               BIT(21)                                              /*!< LIN8 reset */
#define RCU_APB1RST_LIN9RST               BIT(22)                                              /*!< LIN9 reset */
#define RCU_APB1RST_LIN10RST              BIT(23)                                              /*!< LIN10 reset */
#define RCU_APB1RST_LIN11RST              BIT(24)                                              /*!< LIN11 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB1RST_DAC1RST               BIT(25)                                              /*!< DAC1 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB1RST_WWDGT1RST             BIT(26)                                              /*!< WWDGT1 reset */
#define RCU_APB1RST_FWDGT1RST             BIT(27)                                              /*!< FWDGT1 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB1RST_SPI3RST               BIT(28)                                              /*!< SPI3 reset */
#define RCU_APB1RST_SPI4RST               BIT(29)                                              /*!< SPI4 reset */

