sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* RCU_AHBEN */
#define RCU_AHBEN_PAEN                  BIT(0)                               /*!< GPIOA clock enable */
#define RCU_AHBEN_PBEN                  BIT(1)                               /*!< GPIOB clock enable */
#define RCU_AHBEN_PCEN                  BIT(2)                               /*!< GPIOC clock enable */
#define RCU_AHBEN_PDEN                  BIT(3)                               /*!< GPIOD clock enable */
#define RCU_AHBEN_PEEN                  BIT(4)                               /*!< GPIOE clock enable */
#define RCU_AHBEN_PFEN                  BIT(5)                               /*!< GPIOF clock enable */
#define RCU_AHBEN_PGEN                  BIT(6)                               /*!< GPIOG clock enable */
#define RCU_AHBEN_PHEN                  BIT(7)                               /*!< GPIOH clock enable */
#define RCU_AHBEN_PIEN                  BIT(8)                               /*!< GPIOI clock enable */
#define RCU_AHBEN_PJEN                  BIT(9)                               /*!< GPIOJ clock enable */
#define RCU_AHBEN_PKEN                  BIT(10)                              /*!< GPIOK clock enable */
#define RCU_AHBEN_PLEN                  BIT(11)                              /*!< GPIOL clock enable */
#define RCU_AHBEN_PMEN                  BIT(12)                              /*!< GPIOM clock enable */
#define RCU_AHBEN_PNEN                  BIT(13)                              /*!< GPION clock enable */
#define RCU_AHBEN_DMA0EN                BIT(14)                              /*!< DMA0 clock enable */
#define RCU_AHBEN_DMA1EN                BIT(15)                              /*!< DMA1 clock enable */
#define RCU_AHBEN_DMAMUXEN              BIT(16)                              /*!< DMAMUX clock enable */
#define RCU_AHBEN_QSPIEN                BIT(18)                              /*!< QSPI clock enable */
#define RCU_AHBEN_CRCEN                 BIT(20)                              /*!< CRC clock enable */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_AHBEN_MFCOMEN               BIT(21)                              /*!< MFCOM clock enable */
#define RCU_AHBEN_MCMUAEN               BIT(22)                              /*!< MCMUA clock enable */
#define RCU_AHBEN_MCMUBEN               BIT(23)                              /*!< MCMUB clock enable */
#define RCU_AHBEN_HWSEMEN               BIT(24)                              /*!< HWSEM clock enable */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_AHBEN_HSMIFEN               BIT(25)                              /*!< HSMIF clock enable */
#define RCU_AHBEN_FMUEN                 BIT(27)                              /*!< FMU clock enable */
#define RCU_AHBEN_IRMEN                 BIT(28)                              /*!< IRM clock enable */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_AHBEN_IOCEN                 BIT(29)                              /*!< IOC clock enable */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_AHBEN_STCMEN                BIT(30)                              /*!< STCM clock enable */
#define RCU_AHBEN_MTCEN                 BIT(31)                              /*!< MTC clock enable */

/* RCU_APB2EN */
#define RCU_APB2EN_CFGEN                BIT(0)                                /*!< System configuration clock enable */
#define RCU_APB2EN_LINFLEXD0EN          BIT(1)                                /*!< LINFlexD0 clock enable */
#define RCU_APB2EN_LINFLEXD1EN          BIT(2)                                /*!< LINFlexD1 clock enable */
#define RCU_APB2EN_LINFLEXD2EN          BIT(3)                                /*!< LINFlexD2 clock enable */
#define RCU_APB2EN_LINFLEXD3EN          BIT(4)                                /*!< LINFlexD3 clock enable */
#define RCU_APB2EN_LINFLEXD4EN          BIT(5)                                /*!< LINFlexD4 clock enable */
#define RCU_APB2EN_LINFLEXD5EN          BIT(6)                                /*!< LINFlexD5 clock enable */
#define RCU_APB2EN_TRIGSELEN            BIT(7)                                /*!< TRIGSEL clock enable */
#define RCU_APB2EN_ADC0EN               BIT(8)                                /*!< ADC0 clock enable */
#define RCU_APB2EN_ADC1EN               BIT(9)                                /*!< ADC1 clock enable */
#define RCU_APB2EN_TIMER0EN             BIT(10)                               /*!< TIMER0 clock enable */
#define RCU_APB2EN_SPI0EN               BIT(11)                               /*!< SPI0 clock enable */
#define RCU_APB2EN_TIMER7EN             BIT(12)                               /*!< TIMER7 clock enable */
#define RCU_APB2EN_SPI4EN               BIT(16)                               /*!< SPI4 clock enable */
#define RCU_APB2EN_SPI5EN               BIT(17)                               /*!< SPI5 clock enable */
#define RCU_APB2EN_ADC2EN               BIT(18)                               /*!< ADC2 clock enable */
#define RCU_APB2EN_TIMER19EN            BIT(19)                               /*!< TIMER19 clock enable */
#define RCU_APB2EN_TIMER1EN             BIT(20)                               /*!< TIMER1 clock enable */
#define RCU_APB2EN_TIMER5EN             BIT(21)                               /*!< TIMER5 clock enable */
#define RCU_APB2EN_TIMER62EN            BIT(22)                               /*!< TIMER62 clock enable */
#define RCU_APB2EN_CMP1EN               BIT(23)                               /*!< CMP1 clock enable */
#define RCU_APB2EN_SPI1EN               BIT(25)                               /*!< SPI1 clock enable */
#define RCU_APB2EN_CMP0EN               BIT(26)                               /*!< CMP0 clock enable */

/* RCU_APB1EN */
#define RCU_APB1EN_TIMER20EN            BIT(0)                                /*!< TIMER20 clock enable */
#define RCU_APB1EN_TIMER2EN             BIT(1)                                /*!< TIMER2 clock enable */
#define RCU_APB1EN_TIMER60EN            BIT(2)                                /*!< TIMER60 clock enable */
#define RCU_APB1EN_TIMER6EN             BIT(3)                                /*!< TIMER6 clock enable */
#define RCU_APB1EN_WWDGT0EN             BIT(4)                                /*!< WWDGT0 clock enable */
#define RCU_APB1EN_FWDGT0EN             BIT(5)                                /*!< FWDGT0 clock enable */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB1EN_SPI6EN               BIT(6)                                /*!< SPI6 clock enable */
#define RCU_APB1EN_SPI7EN               BIT(7)                                /*!< SPI7 clock enable */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB1EN_I2C0EN               BIT(10)                               /*!< I2C0 clock enable */
#define RCU_APB1EN_I2C1EN               BIT(11)                               /*!< I2C1 clock enable */
#define RCU_APB1EN_BKPEN                BIT(12)                               /*!< BKP clock enable */
#define RCU_APB1EN_PMUEN                BIT(13)                               /*!< PMU clock enable */
#define RCU_APB1EN_DAC0EN               BIT(14)                               /*!< DAC0 clock enable */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB1EN_ENETEN               BIT(15)                               /*!< ENET clock enable */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB1EN_TIMER61EN            BIT(16)                               /*!< TIMER61 clock enable */
#define RCU_APB1EN_TIMER63EN            BIT(17)                               /*!< TIMER63 clock enable */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB1EN_SENTEN               BIT(18)                               /*!< SENT clock enable */
#define RCU_APB1EN_LIN6EN               BIT(19)                               /*!< LIN6 clock enable */
#define RCU_APB1EN_LIN7EN               BIT(20)                               /*!< LIN7 clock enable */
#define RCU_APB1EN_LIN8EN               BIT(21)                               /*!< LIN8 clock enable */
#define RCU_APB1EN_LIN9EN               BIT(22)                               /*!< LIN9 clock enable */
#define RCU_APB1EN_LIN10EN              BIT(23)                               /*!< LIN10 clock enable */
#define RCU_APB1EN_LIN11EN              BIT(24)                               /*!< LIN11 clock enable */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB1EN_DAC1EN               BIT(25)                               /*!< DAC1 clock enable */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_APB1EN_WWDGT1EN             BIT(26)                               /*!< WWDGT1 clock enable */
#define RCU_APB1EN_FWDGT1EN             BIT(27)                               /*!< FWDGT1 clock enable */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_APB1EN_SPI2EN               BIT(28)                               /*!< SPI2 clock enable */
#define RCU_APB1EN_SPI3EN               BIT(29)                               /*!< SPI3 clock enable */
#define RCU_APB1EN_CLTCFGEN             BIT(30)                               /*!< CLTCFG clock enable */

/* RCU_BDCTL */
#define RCU_BDCTL_LXTALEN               BIT(0)                                /*!< LXTAL enable */
#define RCU_BDCTL_LXTALSTB              BIT(1)                                /*!< low speed crystal oscillator stabilization flag */
#define RCU_BDCTL_LXTALBPS              BIT(2)                                /*!< LXTAL bypass mode enable */
#define RCU_BDCTL_LXTALDRI              BITS(3,4)                             /*!< LXTAL drive capability */
#define RCU_BDCTL_RTCSRC                BITS(8,9)                             /*!< RTC clock source selection */
#define RCU_BDCTL_RTCEN                 BIT(15)                               /*!< RTC clock enable */

