sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* RCU_APB2EN_ADD */
#define RCU_APB2EN_ADD_DTM_CAN0EN           BIT(0)                                /*!< DTM_CAN0 clock enable */
#define RCU_APB2EN_ADD_DTM_CAN1EN           BIT(1)                                /*!< DTM_CAN1 clock enable */
#define RCU_APB2EN_ADD_DTM_CAN2EN           BIT(2)                                /*!< DTM_CAN2 clock enable */
#define RCU_APB2EN_ADD_DTM_CAN3EN           BIT(3)                                /*!< DTM_CAN3 clock enable */
#define RCU_APB2EN_ADD_DTM_CAN4EN           BIT(4)                                /*!< DTM_CAN4 clock enable */
#define RCU_APB2EN_ADD_DTM_CAN5EN           BIT(5)                                /*!< DTM_CAN5 clock enable */
#define RCU_APB2EN_ADD_DTM_CAN6EN           BIT(6)                                /*!< DTM_CAN6 clock enable */
#define RCU_APB2EN_ADD_DTM_CAN7EN           BIT(7)                                /*!< DTM_CAN7 clock enable */

/* RCU_AHBEN_ADD */
#define RCU_AHBEN_ADD_CM7_0_EN           BIT(0)                               /*!< CPU CM7_0 clock enable */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_AHBEN_ADD_CM7_1_EN           BIT(1)                               /*!< CPU CM7_1 clock enable */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/* RCU_CFG1 */
#define RCU_CFG1_PREDV                  BITS(0,2)                             /*!< CK_HXTAL or IRC48M divider previous PLL */
#define RCU_CFG1_PLLDIVP                BITS(3,8)                             /*!< PLL VCO clock divide */
#define RCU_CFG1_PLLDIVQ                BITS(9,14)                            /*!< PLL VCO clock divide */
#define RCU_CFG1_FWDGT0SEL              BIT(15)                               /*!< FWDGTSEL0 clock select */
#define RCU_CFG1_CKOUT0SEL              BITS(16,19)                           /*!< CK_OUT0 clock source selection */
#define RCU_CFG1_CKOUT0DIV              BITS(20,22)                           /*!< The CK_OUT0 divider which the CK_OUT2 frequency can be reduced, */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_CFG1_ATESEL                 BITS(24,25)                           /*!< ATE clock of STCM */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_CFG1_AITSEL                 BITS(26,27)                           /*!< AIT clock of STCM */
#define RCU_CFG1_IRC48MFR               BIT(30)                               /*!< IRC48M fail response */

/* RCU_CFG2 */
#define RCU_CFG2_USART0SEL              BITS(0,1)                             /*!< USART0 clock source selection */
#define RCU_CFG2_USART1SEL              BITS(2,3)                             /*!< USART1 clock source selection */
#define RCU_CFG2_USART2SEL              BITS(4,5)                             /*!< USART2 clock source selection */
#define RCU_CFG2_USART3SEL              BITS(6,7)                             /*!< USART3 clock source selection */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_CFG2_USART4SEL              BITS(8,9)                             /*!< USART4 clock source selection */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_CFG2_DTM_CAN0SEL            BITS(10,11)                           /*!< DTM_CAN0 clock source selection */
#define RCU_CFG2_DTM_CAN1SEL            BITS(12,13)                           /*!< DTM_CAN1 clock source selection */
#define RCU_CFG2_DTM_CAN2SEL            BITS(14,15)                           /*!< DTM_CAN2 clock source selection */
#define RCU_CFG2_DTM_CAN3SEL            BITS(16,17)                           /*!< DTM_CAN3 clock source selection */
#define RCU_CFG2_DTM_CAN4SEL            BITS(18,19)                           /*!< DTM_CAN4 clock source selection */
#define RCU_CFG2_DTM_CAN5SEL            BITS(20,21)                           /*!< DTM_CAN5 clock source selection */
#define RCU_CFG2_DTM_CAN6SEL            BITS(22,23)                           /*!< DTM_CAN6 clock source selection */
#define RCU_CFG2_ADCCLK_MUX             BIT(24)                               /*!< ADC clock source selection */
#define RCU_CFG2_ADCSEL                 BIT(25)                               /*!< ADC clock source selection */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_CFG2_FWDGT1SEL              BIT(26)                               /*!< FWDGT1SEL clock select */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_CFG2_ADCPSC                 BITS(27,31)                           /*!< ADC clock prescaler selection */

/* RCU_CFG3 */
#define RCU_CFG3_SPISEL                 BITS(0,1)                             /*!< SPI clock source selection */
#define RCU_CFG3_DTM_CAN7SEL            BITS(2,3)                             /*!< DTM_CAN7 clock source selection */
#define RCU_CFG3_SPIDIV                 BITS(4,9)                             /*!< SPI clock divider */
#define RCU_CFG3_LINFLEXDDIV            BITS(10,13)                           /*!< LINFlexD clock divider */
#define RCU_CFG3_LINFLEXDSEL            BITS(14,15)                           /*!< LINFlexD clock source selection */
#define RCU_CFG3_WWDGT0SEL              BITS(16,18)                           /*!< WWDGT0SEL clock select */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_CFG3_WWDGT1SEL              BITS(19,21)                           /*!< WWDGT1SEL clock select */
#define RCU_CFG3_ENETTSSEL              BITS(22,24)                           /*!< ENETTS CLK divider */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_CFG3_QSPISEL                BITS(25,26)                           /*!< QSPI clock source selection */
#define RCU_CFG3_TRACEDIV               BITS(27,29)                           /*!< TRACE clock divider */
#define RCU_CFG3_TRACESEL               BITS(30,31)                           /*!< TRACE clock source selection */

/* RCU_PLLLOL */
#define RCU_PLLLOL_PLLLOLCTL            BITS(0,1)                             /*!< Adjust the loss of lock accuracy */
#define RCU_PLLLOL_PLLLOLF              BIT(2)                                /*!< Loss of lock detector flag */
#define RCU_PLLLOL_PLLLOLFC             BIT(3)                                /*!< Clear PLLLOLF flag */

/* RCU_CKDCTL */
#define RCU_CKDCTL_CKD0_FDEN            BIT(0)                                /*!< CKD0 frequency detect Enable */
#define RCU_CKDCTL_CKD0_FDERR           BIT(1)                                /*!< CKD0 frequency detect error */
#define RCU_CKDCTL_CKD0_FDEIE           BIT(2)                                /*!< CKD0 frequency detect error interrupt enable */
#define RCU_CKDCTL_CKD1_FDEN            BIT(8)                                /*!< CKD1 frequency detect Enable */
#define RCU_CKDCTL_CKD1_FDERR           BIT(9)                                /*!< CKD1 frequency detect error */
#define RCU_CKDCTL_CKD1_FDEIE           BIT(10)                               /*!< CKD1 frequency detect error interrupt enable */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_CKDCTL_CKD2_FDEN            BIT(16)                               /*!< CKD2 frequency detect Enable */
#define RCU_CKDCTL_CKD2_FDERR           BIT(17)                               /*!< CKD2 frequency detect error */
#define RCU_CKDCTL_CKD2_FDEIE           BIT(18)                               /*!< CKD2 frequency detect error interrupt enable */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* RCU_CKFMCTL */
#define RCU_CKFMCTL_FMEN                BIT(0)                                /*!< Frequency monitor Enable */
#define RCU_CKFMCTL_FLMIN               BIT(1)                                /*!< Frequency lower than low frequency reference threshold event status */
#define RCU_CKFMCTL_FHMAX               BIT(2)                                /*!< Frequency higher than high frequency reference threshold event status */
#define RCU_CKFMCTL_FLMINIE             BIT(3)                                /*!< Frequency Lower than Low Frequency Reference Threshold synchronous interrupt Enable*/
#define RCU_CKFMCTL_FHMAXIE             BIT(4)                                /*!< Frequency Higher than High Frequency Reference Threshold synchronous interrupt Enable */
#define RCU_CKFMCTL_FLMINRE             BIT(5)                                /*!< Frequency Lower than Low Frequency Reference Threshold reset Enable*/
#define RCU_CKFMCTL_FHMAXRE             BIT(6)                                /*!< Frequency Higher than High Frequency Reference Threshold reset Enable */

/* RCU_CKFMRCCFG */
#define RCU_CKFMRCCFG_REF_CNT           BITS(0,15)                            /*!< Reference clock count */

/* RCU_CKFMHTHCFG */                                                   
#define RCU_CKFMHTHCFG_HFMAX            BITS(0,23)                            /*!< High frequency reference threshold */

/* RCU_CKFMLTHCFG */                                                   
#define RCU_CKFMLTHCFG_LFMIN            BITS(0,23)                            /*!< Low frequency reference threshold */

/* RCU_BUSIM_TMR */
#define RCU_BUSIM_TMR_TMR_EN0            BIT(0)                               /*!< TMR error 0 output to fmu enable */
#define RCU_BUSIM_TMR_TMR_EN1            BIT(1)                               /*!< TMR error 1 output to fmu enable */
#define RCU_BUSIM_TMR_TMR_EN2            BIT(2)                               /*!< TMR error 2 output to fmu enable */
#define RCU_BUSIM_TMR_TMR_EN3            BIT(3)                               /*!< TMR error 3 output to fmu enable */
#define RCU_BUSIM_TMR_TMR_ST0            BIT(4)                               /*!< System clock switching TMR error status */
#define RCU_BUSIM_TMR_TMR_ST1            BIT(5)                               /*!< Clock enable TMR error status */
#define RCU_BUSIM_TMR_TMR_ST2            BIT(6)                               /*!< Clock monitor enable register TMR error status */
#define RCU_BUSIM_TMR_TMR_ST3            BIT(7)                               /*!< The TMR error occurs in any bit of TRIM register */

/* RCU_PLLFRA */
#define RCU_PLLFRA_PLLFRACN             BITS(0,13)                            /*!< Fractional part of the multiplication factor for PLL VCO */
#define RCU_PLLFRA_PLLFRAEN             BIT(15)                               /*!< PLL fractional latch enable */

/* RCU_PLLSSCTL */
#define RCU_PLLSSCTL_MODCNT             BITS(0,10)                            /*!< these bits configure PLL spread spectrum modulation 
                                                                                    profile amplitude and frequency. the following criteria 
                                                                                    must be met: MODSTEP*MODCNT <=2^14 */
#define RCU_PLLSSCTL_MODSTEP            BITS(13,22)                           /*!< these bits configure PLL spread spectrum modulation 
                                                                                   profile amplitude and frequency. the following criteria 
                                                                                   must be met: MODSTEP*MODCNT <=2^14 */
#define RCU_PLLSSCTL_SS_TYPE            BIT(30)                               /*!< PLL spread spectrum modulation type select */
#define RCU_PLLSSCTL_SSCGBYP            BIT(31)                               /*!< PLL spread spectrum modulation bypass enable */

