sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* RCU_SYSRSTSTAT */
#define RCU_SYSRSTSTAT_PORF             BIT(0)                                 /*!< Power-on reset flag */
#define RCU_SYSRSTSTAT_FMU_REA_FAIL     BIT(3)                                 /*!< 'System' reset flag FMU_REA_FAIL */
#define RCU_SYSRSTSTAT_STCM_REC_FAIL    BIT(4)                                 /*!< 'System' reset flag STCM_REC_FAIL */
#define RCU_SYSRSTSTAT_RCTL_SUBSRUF     BIT(6)                                 /*!< 'System' reset flag RCTL_SUBSRUF */
#define RCU_SYSRSTSTAT_LOHRSTF          BIT(8)                                 /*!< Lost of HXTAL error reset flag */
#define RCU_SYSRSTSTAT_LOPRSTF          BIT(9)                                 /*!< Lost of PLL error reset flag */
#define RCU_SYSRSTSTAT_CORE_CK_FAIL     BIT(10)                                /*!< 'System' reset flag CORE_CK_FAIL */
#define RCU_SYSRSTSTAT_SYS_CK_FAIL      BIT(12)                                /*!< 'System' reset flag SYS_CK_FAIL */
#define RCU_SYSRSTSTAT_HSM_SYS_RSTF     BIT(18)                                /*!< 'System' reset flag HSM_SYS_RSTF */
#define RCU_SYSRSTSTAT_SW_SYS_RSTF      BIT(29)                                /*!< 'System' reset flag SW_SYS_RSTF */
#define RCU_SYSRSTSTAT_DBG_SYS_RSTF     BIT(30)                                /*!< 'System' reset flag DBG_SYS_RSTF */

/* RCU_BUSCTL */
#define RCU_BUSCTL_BUSCTL               BIT(0)                                 /*!< bus access control */

/* RCU_SUBSERSTAT */
#define RCU_SUBSERSTAT_EXRF             BIT(0)                                 /*!< External reset flag EXRF */
#define RCU_SUBSERSTAT_OBSTDBY_RSTF     BIT(2)                                 /*!< Subsystem reset flag OBSTDBY_RSTF */
#define RCU_SUBSERSTAT_FMU_RSTF         BIT(3)                                 /*!< Subsystem reset flag FMU_RSTF */
#define RCU_SUBSERSTAT_ST_FINISH        BIT(4)                                 /*!< Subsystem reset flag ST_FINISH */
#define RCU_SUBSERSTAT_FWDGT0_RSTF      BIT(6)                                 /*!< Subsystem reset flag FWDGT0_RSTF */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_SUBSERSTAT_FWDGT1_RSTF      BIT(7)                                 /*!< Subsystem reset flag FWDGT1_RSTF */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_SUBSERSTAT_SWRSTF           BIT(9)                                 /*!< Software reset flag */
#define RCU_SUBSERSTAT_WWDGT0_RSTF      BIT(10)                                /*!< Subsystem reset flag WWDGT0_RSTF */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_SUBSERSTAT_WWDGT1_RSTF      BIT(11)                                /*!< Subsystem reset flag WWDGT1_RSTF */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_SUBSERSTAT_HSM_WDGT_RSTF    BIT(16)                                /*!< Subsystem reset flag HSM_WDGT_RSTF */
#define RCU_SUBSERSTAT_HSM_APP_RSTF     BIT(20)                                /*!< Subsystem reset flag HSM_APP_RSTF */
#define RCU_SUBSERSTAT_SW_SUBS_RSTF     BIT(29)                                /*!< Subsystem reset flag SW_SUBS_RSTF */
#define RCU_SUBSERSTAT_DBG_RSTF         BIT(30)                                /*!< Debug reset flag DBG_RSTF */
#define RCU_SUBSERSTAT_OBL_RSTF         BIT(31)                                /*!< Option byte loader reset flag */
/* RCU_SUBSRCTL */
#define RCU_SUBSRCTL_FMU_RST_RD        BIT(3)                                  /*!< FMU_RD disable control */
#define RCU_SUBSRCTL_FWDGT0_RST_RD     BIT(6)                                  /*!< FWDGT0_RST_RD disable control */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_SUBSRCTL_FWDGT1_RST_RD     BIT(7)                                  /*!< FWDGT1_RST disable control */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_SUBSRCTL_WWDGT0_RST_RD     BIT(10)                                 /*!< WWDGT0_RST disable control */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_SUBSRCTL_WWDGT1_RST_RD     BIT(11)                                 /*!< WWDGT1_RST disable control */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_SUBSRCTL_DBG_RST_RD        BIT(30)                                 /*!< DBG_RST disable control */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_SUBSRCTL_OBL_RST_RD        BIT(31)                                 /*!< OBL_RST disable control */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* RCU_SUBSRPACTL */
#define RCU_SUBSRPACTL_ST_FINISH_RPAEN   BIT(4)                                /*!< Reset pin assert enable for subsystem reset ST_FINISH */


/* RCU_SUBSRMUCNT */
#define RCU_SUBSRMUCNT_SUBSRMUCNT        BITS(0,3)                             /*!< Subsystem reset mode upgrade counter */

/* RCU_SUBSRMUTH */
#define RCU_SUBSRMUTH_SUBSRMUTH          BITS(0,3)                             /*!< Subsystem reset mode upgrade threshold */

/* RCU_SYSMRUTH */
#define RCU_SYSMRUTH_SYSMRUTH            BITS(0,3)                             /*!< System reset mode upgrade threshold */

/* RCU_ERPACFG */
#define RCU_ERPACFG_ERPAETEN             BIT(0)                                /*!< External reset pin assert enable */

/* RCU_RDSMSTAT */
#define RCU_RDSMSTAT_SYSRESF          BIT(0)                                   /*!< System reset event occurred flag in standby mode */
#define RCU_RDSMSTAT_SUBSRESF         BIT(1)                                   /*!< Subsystem reset event occurred flag in standby mode */

/* RCU_SUBSRTO */
#define RCU_SUBSRTO_SUBSRTOEN         BIT(0)                                   /*!< Subsystem reset timer enable */
#define RCU_SUBSRTO_SUBSRTO           BITS(1,31)                               /*!< Subsystem reset timer value */

/* RCU_LPDBGSTAT */
#define RCU_LPDBGSTAT_LPDBGF          BIT(0)                                   /*!< Low-Power debug flag */

/* RCU_PORSTAT0 */
#define RCU_PORSTAT0_PORWDG_OVF0      BIT(0)                             /*!< PORWDG_OVF0 captures the status of subsystem reset sequence process SUBSRST0 when PORWDG overflows */
#define RCU_PORSTAT0_PORWDG_OVF1      BIT(1)                             /*!< PORWDG_OVF1 captures the status of subsystem reset sequence process SUBSRST1 when PORWDG overflows */
#define RCU_PORSTAT0_PORWDG_OVF2      BIT(2)                             /*!< PORWDG_OVF2 captures the status of subsystem reset sequence process SUBSRST2 when PORWDG overflows*/
#define RCU_PORSTAT0_PORWDG_OVF3      BIT(3)                             /*!< PORWDG_OVF3 captures the status of subsystem reset sequence process SUBSRST3 when PORWDG overflows*/
#define RCU_PORSTAT0_PORWDG_OVF4      BIT(4)                             /*!< PORWDG_OVF4 captures the status of subsystem reset sequence process SUBSRST4 when PORWDG overflows*/
#define RCU_PORSTAT0_PORWDG_OVF5      BIT(5)                             /*!< PORWDG_OVF5 captures the status of subsystem reset sequence process SUBSRST5 when PORWDG overflows*/
#define RCU_PORSTAT0_PORWDG_OVF6      BIT(6)                             /*!< PORWDG_OVF6 captures the status of subsystem reset sequence process SUBSRST6 when PORWDG overflows*/
#define RCU_PORSTAT0_PORWDG_OVF10     BIT(10)                            /*!< PORWDG_OVF10 captures the status of subsystem reset sequence process SUBSRST7 when PORWDG overflows*/
#define RCU_PORSTAT0_PORWDG_OVF11     BIT(11)                            /*!< PORWDG_OVF11 captures the status of subsystem reset sequence process SUBSRST8 when PORWDG overflows*/
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_PORSTAT0_PORWDG_OVF14     BIT(14)                            /*!< PORWDG_OVF14 captures the status of subsystem reset sequence process SUBSRST9 when PORWDG overflows*/
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_PORSTAT0_PORWDG_OVF20     BIT(20)                            /*!< PORWDG_OVF20 captures the status of subsystem reset sequence process SYSRST0 when PORWDG overflows */
#define RCU_PORSTAT0_PORWDG_OVF29     BIT(29)                            /*!< PORWDG_OVF29 captures the status of standby entry request initiated by PMU when PORWDG overflows */
#define RCU_PORSTAT0_PORWDG_OVF30     BIT(30)                            /*!< PORWDG_OVF30 captures the status of standby exit acknowledgement by PMU when POR_WDG overflows */
#define RCU_PORSTAT0_PORWDG_OVF31     BIT(31)                            /*!< PORWDG_OVF31 captures RCTL reset event (if occurred) while the device is in standby mode*/

/* RCU_PORSTAT1 */
#define RCU_PORSTAT1_PORWDG_OVF32      BIT(0)                            /*!< PORWDG_OVF32 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[0]) */
#define RCU_PORSTAT1_PORWDG_OVF33      BIT(1)                            /*!< PORWDG_OVF33 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[1]) */
#define RCU_PORSTAT1_PORWDG_OVF34      BIT(2)                            /*!< PORWDG_OVF34 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[2]) */
#define RCU_PORSTAT1_PORWDG_OVF35      BIT(3)                            /*!< PORWDG_OVF35 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[3]) */
#define RCU_PORSTAT1_PORWDG_OVF36      BIT(4)                            /*!< PORWDG_OVF36 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[4]) */
#define RCU_PORSTAT1_PORWDG_OVF37      BIT(5)                            /*!< PORWDG_OVF37 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[5]) */
#define RCU_PORSTAT1_PORWDG_OVF38      BIT(6)                            /*!< PORWDG_OVF38 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[6]) */
#define RCU_PORSTAT1_PORWDG_OVF39      BIT(7)                            /*!< PORWDG_OVF39 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[7]) */
#define RCU_PORSTAT1_PORWDG_OVF40      BIT(8)                            /*!< PORWDG_OVF40 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[8]) */
#define RCU_PORSTAT1_PORWDG_OVF41      BIT(9)                            /*!< PORWDG_OVF41 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[9]) */
#define RCU_PORSTAT1_PORWDG_OVF42      BIT(10)                           /*!< PORWDG_OVF42 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[10]) */
#define RCU_PORSTAT1_PORWDG_OVF43      BIT(11)                           /*!< PORWDG_OVF43 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[11]) */
#define RCU_PORSTAT1_PORWDG_OVF44      BIT(12)                           /*!< PORWDG_OVF44 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[12]) */
#define RCU_PORSTAT1_PORWDG_OVF45      BIT(13)                           /*!< PORWDG_OVF45 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[13]) */
#define RCU_PORSTAT1_PORWDG_OVF46      BIT(14)                           /*!< PORWDG_OVF46 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[14]) */
#define RCU_PORSTAT1_PORWDG_OVF47      BIT(15)                           /*!< PORWDG_OVF47 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[15]) */
#define RCU_PORSTAT1_PORWDG_OVF48      BIT(16)                           /*!< PORWDG_OVF48 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[16]) */
#define RCU_PORSTAT1_PORWDG_OVF49      BIT(17)                           /*!< PORWDG_OVF49 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[17]) */
#define RCU_PORSTAT1_PORWDG_OVF50      BIT(18)                           /*!< PORWDG_OVF50 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[18]) */
#define RCU_PORSTAT1_PORWDG_OVF51      BIT(19)                           /*!< PORWDG_OVF51 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[19]) */
#define RCU_PORSTAT1_PORWDG_OVF52      BIT(20)                           /*!< PORWDG_OVF52 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[20]) */
#define RCU_PORSTAT1_PORWDG_OVF53      BIT(21)                           /*!< PORWDG_OVF53 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[21]) */
#define RCU_PORSTAT1_PORWDG_OVF54      BIT(22)                           /*!< PORWDG_OVF54 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[22]) */
#define RCU_PORSTAT1_PORWDG_OVF55      BIT(23)                           /*!< PORWDG_OVF55 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[23]) */
#define RCU_PORSTAT1_PORWDG_OVF56      BIT(24)                           /*!< PORWDG_OVF56 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[24]) */
#define RCU_PORSTAT1_PORWDG_OVF57      BIT(25)                           /*!< PORWDG_OVF57 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[25]) */
#define RCU_PORSTAT1_PORWDG_OVF58      BIT(26)                           /*!< PORWDG_OVF58 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[26]) */
#define RCU_PORSTAT1_PORWDG_OVF59      BIT(27)                           /*!< PORWDG_OVF59 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[27]) */
#define RCU_PORSTAT1_PORWDG_OVF60      BIT(28)                           /*!< PORWDG_OVF60 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[28]) */
#define RCU_PORSTAT1_PORWDG_OVF61      BIT(29)                           /*!< PORWDG_OVF61 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[29]) */
#define RCU_PORSTAT1_PORWDG_OVF62      BIT(30)                           /*!< PORWDG_OVF62 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[30]) */
#define RCU_PORSTAT1_PORWDG_OVF63      BIT(31)                           /*!< PORWDG_OVF63 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[31]) */

