sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* RCU_PORSTAT2 */
#define RCU_PORSTAT2_PORWDG_OVF64      BIT(0)                            /*!< PORWDG_OVF64 captures RCTL system event status register when PORWDG overflows (RCU_SYSRSTSTAT[0]) */
#define RCU_PORSTAT2_PORWDG_OVF65      BIT(1)                            /*!< PORWDG_OVF65 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[1]) */
#define RCU_PORSTAT2_PORWDG_OVF66      BIT(2)                            /*!< PORWDG_OVF66 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[2]) */
#define RCU_PORSTAT2_PORWDG_OVF67      BIT(3)                            /*!< PORWDG_OVF67 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[3]) */
#define RCU_PORSTAT2_PORWDG_OVF68      BIT(4)                            /*!< PORWDG_OVF68 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[4]) */
#define RCU_PORSTAT2_PORWDG_OVF69      BIT(5)                            /*!< PORWDG_OVF69 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[5]) */
#define RCU_PORSTAT2_PORWDG_OVF70      BIT(6)                            /*!< PORWDG_OVF70 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[6]) */
#define RCU_PORSTAT2_PORWDG_OVF71      BIT(7)                            /*!< PORWDG_OVF71 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[7]) */
#define RCU_PORSTAT2_PORWDG_OVF72      BIT(8)                            /*!< PORWDG_OVF72 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[8]) */
#define RCU_PORSTAT2_PORWDG_OVF73      BIT(9)                            /*!< PORWDG_OVF73 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[9]) */
#define RCU_PORSTAT2_PORWDG_OVF74      BIT(10)                           /*!< PORWDG_OVF74 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[10]) */
#define RCU_PORSTAT2_PORWDG_OVF75      BIT(11)                           /*!< PORWDG_OVF75 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[11]) */
#define RCU_PORSTAT2_PORWDG_OVF76      BIT(12)                           /*!< PORWDG_OVF76 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[12]) */
#define RCU_PORSTAT2_PORWDG_OVF77      BIT(13)                           /*!< PORWDG_OVF77 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[13]) */
#define RCU_PORSTAT2_PORWDG_OVF78      BIT(14)                           /*!< PORWDG_OVF78 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[14]) */
#define RCU_PORSTAT2_PORWDG_OVF79      BIT(15)                           /*!< PORWDG_OVF79 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[15]) */
#define RCU_PORSTAT2_PORWDG_OVF80      BIT(16)                           /*!< PORWDG_OVF80 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[16]) */
#define RCU_PORSTAT2_PORWDG_OVF81      BIT(17)                           /*!< PORWDG_OVF81 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[17]) */
#define RCU_PORSTAT2_PORWDG_OVF82      BIT(18)                           /*!< PORWDG_OVF82 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[18]) */
#define RCU_PORSTAT2_PORWDG_OVF83      BIT(19)                           /*!< PORWDG_OVF83 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[19]) */
#define RCU_PORSTAT2_PORWDG_OVF84      BIT(20)                           /*!< PORWDG_OVF84 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[20]) */
#define RCU_PORSTAT2_PORWDG_OVF85      BIT(21)                           /*!< PORWDG_OVF85 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[21]) */
#define RCU_PORSTAT2_PORWDG_OVF86      BIT(22)                           /*!< PORWDG_OVF86 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[22]) */
#define RCU_PORSTAT2_PORWDG_OVF87      BIT(23)                           /*!< PORWDG_OVF87 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[23]) */
#define RCU_PORSTAT2_PORWDG_OVF88      BIT(24)                           /*!< PORWDG_OVF88 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[24]) */
#define RCU_PORSTAT2_PORWDG_OVF89      BIT(25)                           /*!< PORWDG_OVF89 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[25]) */
#define RCU_PORSTAT2_PORWDG_OVF90      BIT(26)                           /*!< PORWDG_OVF90 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[26]) */
#define RCU_PORSTAT2_PORWDG_OVF91      BIT(27)                           /*!< PORWDG_OVF91 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[27]) */
#define RCU_PORSTAT2_PORWDG_OVF92      BIT(28)                           /*!< PORWDG_OVF92 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[28]) */
#define RCU_PORSTAT2_PORWDG_OVF93      BIT(29)                           /*!< PORWDG_OVF93 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[29]) */
#define RCU_PORSTAT2_PORWDG_OVF94      BIT(30)                           /*!< PORWDG_OVF94 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[30]) */
#define RCU_PORSTAT2_PORWDG_OVF95      BIT(31)                           /*!< PORWDG_OVF95 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[31]) */

/* RCU_PORSTAT3 */
#define RCU_PORSTAT3_PORWDG_OVF96      BIT(0)                            /*!< PORWDG_OVF96 captures captures PORWDG reset event if PORWDG initiates a POR sequence */

/* RCU_TMRERRSTAT */
#define RCU_TMRERRSTAT_TMR_RCU_SYSRSTSTATEN       BIT(0)                            /*!< RCU_SYSRSTSTAT TMR error output enable */
#define RCU_TMRERRSTAT_TMR_RCU_SYSRSTSTAT         BIT(1)                            /*!< RCU_SYSRSTSTAT TMR error status */
#define RCU_TMRERRSTAT_TMR_RCU_SUBSRCTLEN         BIT(2)                            /*!< RCU_SUBSRCTL TMR error output enable */
#define RCU_TMRERRSTAT_TMR_RCU_SUBSRCTL           BIT(3)                            /*!< RCU_SUBSRCTL TMR error status */
#define RCU_TMRERRSTAT_TMR_RCU_SUBSRPACTLEN       BIT(4)                            /*!< RCU_SUBSRPACTL TMR error output enable */
#define RCU_TMRERRSTAT_TMR_RCU_SUBSRPACTL         BIT(5)                            /*!< RCU_SUBSRPACTL TMR error status */
#define RCU_TMRERRSTAT_TMR_RCU_SYSMRETHEN         BIT(6)                            /*!< RCU_SYSMRETH TMR error output enable */
#define RCU_TMRERRSTAT_TMR_RCU_SYSMRETH           BIT(7)                            /*!< RCU_SYSMRETH TMR error status */
#define RCU_TMRERRSTAT_TMR_RCU_ERPACFGEN          BIT(8)                            /*!< TMR_RCU_ERPACFG TMR error output enable */
#define RCU_TMRERRSTAT_TMR_RCU_ERPACFG            BIT(9)                            /*!< TMR_RCU_ERPACFG TMR error status */
#define RCU_TMRERRSTAT_TMR_AHBRSTEN               BIT(10)                           /*!< AHBRST TMR error output enable */
#define RCU_TMRERRSTAT_TMR_AHBRST                 BIT(11)                           /*!< AHBRST TMR error status */
#define RCU_TMRERRSTAT_TMR_APBRSTEN               BIT(12)                           /*!< APBRST1/2  TMR error output enable */
#define RCU_TMRERRSTAT_TMR_APBRST                 BIT(13)                           /*!< APBRST1/2  TMR error status */
#define RCU_TMRERRSTAT_TMR_PORWDG1EN              BIT(16)                           /*!< PORWDG1 TMR error output enable */
#define RCU_TMRERRSTAT_TMR_PORWDG1                BIT(17)                           /*!< PORWDG1 TMR error status */
#define RCU_TMRERRSTAT_TMR_PORWDG2EN              BIT(18)                           /*!< PORWDG2 TMR error output enable */
#define RCU_TMRERRSTAT_TMR_PORWDG2                BIT(19)                           /*!< PORWDG2 TMR error status */
#define RCU_TMRERRSTAT_TMR_PORWDG3EN              BIT(20)                           /*!< PORWDG3 TMR error output enable */
#define RCU_TMRERRSTAT_TMR_PORWDG3                BIT(21)                           /*!< PORWDG3 TMR error status */
#define RCU_TMRERRSTAT_TMR_PORWDG4EN              BIT(22)                           /*!< PORWDG4 TMR error output enable */
#define RCU_TMRERRSTAT_TMR_PORWDG4                BIT(23)                           /*!< PORWDG4 TMR error status */

