sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* RCU_SYSRSTUCNT */
#define RCU_SYSRSTUCNT_SYSRTOEN                   BITS(0,3)                         /*!< System reset upgrade counter */

/* RCU_SUBSRSTCNT */
#define RCU_SUBSRSTCNT_SUBSRSTCNT                 BITS(0,3)                         /*!< Subsystem reset counter */

/* RCU_SYSRSTCNT */
#define RCU_SYSRSTCNT_SYSRSTCNT                   BITS(0,3)                         /*!< System reset counter */

/* RCU_SUBSRSTAD */
#define RCU_SUBSRSTAD_SUBSRST_ALL_DIS             BIT(0)                            /*!< Disable all subsystem reset */

/* CKFMx select */
#define CKFM0                                     0x0U                            /*!< CKFM0 */
#define CKFM1                                     0x1U                            /*!< CKFM1 */
#define CKFM2                                     0x2U                            /*!< CKFM2 */
#define CKFM3                                     0x3U                            /*!< CKFM3 */
#define CKFM4                                     0x4U                            /*!< CKFM4 */

/* CKDX select */
typedef enum {
    CKD0 = 0x0U,                                                                   /*!< CKD 0 */
    CKD1,                                                                          /*!< CKD 1 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    CKD2,                                                                          /*!< CKD 2 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
} ckd_enum;


/* constants definitions */
/* define the peripheral clock enable bit position and its register index offset */
#define RCU_REGIDX_BIT(regidx, bitpos)      (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define RCU_CCTL_REG_VAL(periph)            (REG32(CCTL + ((uint32_t)(periph) >> 6)))
#define RCU_RCTL_REG_VAL(periph)            (REG32(RCTL + ((uint32_t)(periph) >> 6)))
#define RCU_BIT_POS(val)                    ((uint32_t)(val) & 0x0000001FU)

/* register offset */
/* peripherals enable */
#define AHBEN_REG_OFFSET                0x00000014U                          /*!< AHB enable register offset */
#define APB1EN_REG_OFFSET               0x0000001CU                          /*!< APB1 enable register offset */
#define APB2EN_REG_OFFSET               0x00000018U                          /*!< APB2 enable register offset */
#define APB2EN_ADD_REG_OFFSET           0x00000024U                          /*!< APB2 enable register offset */
#define AHBEN_ADD_REG_OFFSET            0x00000028U                          /*!< AHB enable register offset */

/* peripherals reset */
#define AHBRST_REG_OFFSET               0x00000030U                          /*!< AHB reset register offset */
#define APB1RST_REG_OFFSET              0x00000034U                          /*!< APB1 reset register offset */
#define APB2RST_REG_OFFSET              0x00000038U                          /*!< APB2 reset register offset */
#define APB2RST_ADD_REG_OFFSET          0x0000003CU                          /*!< APB2 ADD reset register offset */

/* clock control */
#define CTL_REG_OFFSET                  0x00000000U                          /*!< control register offset */
#define BDCTL_REG_OFFSET                0x00000020U                          /*!< backup domain control register offset */

/* clock stabilization and stuck interrupt */
#define INT_REG_OFFSET                  0x00000008U                          /*!< clock interrupt register offset */

/* configuration register */
#define CFG0_REG_OFFSET                 0x00000004U                          /*!< clock configuration register 0 offset */
#define CFG1_REG_OFFSET                 0x0000002CU                          /*!< clock configuration register 1 offset */
#define CFG2_REG_OFFSET                 0x00000030U                          /*!< clock configuration register 2 offset */
#define CFG3_REG_OFFSET                 0x00000034U                          /*!< clock configuration register 3 offset */

/* POR watchdog overflows status register */
#define PORSTAT0_REG_OFFSET             0x00000040U                          /*!< POR watchdog overflows status register 0 offset */
#define PORSTAT1_REG_OFFSET             0x00000044U                          /*!< POR watchdog overflows status register 1 offset */
#define PORSTAT2_REG_OFFSET             0x00000048U                          /*!< POR watchdog overflows status register 2 offset */
#define PORSTAT3_REG_OFFSET             0x0000004CU                          /*!< POR watchdog overflows status register 3 offset */

/* peripheral clock enable */
typedef enum {
    /* AHB peripherals */
    RCU_GPIOA     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 0U),                     /*!< GPIOA clock */
    RCU_GPIOB     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 1U),                     /*!< GPIOB clock */
    RCU_GPIOC     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 2U),                     /*!< GPIOC clock */
    RCU_GPIOD     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 3U),                     /*!< GPIOD clock */
    RCU_GPIOE     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 4U),                     /*!< GPIOE clock */
    RCU_GPIOF     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 5U),                     /*!< GPIOF clock */
    RCU_GPIOG     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 6U),                     /*!< GPIOA clock */
    RCU_GPIOH     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 7U),                     /*!< GPIOB clock */
    RCU_GPIOI     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 8U),                     /*!< GPIOC clock */
    RCU_GPIOJ     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 9U),                     /*!< GPIOD clock */
    RCU_GPIOK     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 10U),                    /*!< GPIOE clock */
    RCU_GPIOL     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 11U),                    /*!< GPIOF clock */
    RCU_GPIOM     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 12U),                    /*!< GPIOE clock */
    RCU_GPION     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 13U),                    /*!< GPIOF clock */
    RCU_DMA0      = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 14U),                    /*!< DMA0 clock */
    RCU_DMA1      = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 15U),                    /*!< DMA1 clock */
    RCU_DMAMUX    = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 16U),                    /*!< DMAMUX clock */
    RCU_QSPI      = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 18U),                    /*!< QSPI clock */
    RCU_CRC       = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 20U),                    /*!< CRC clock */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_MFCOM     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 21U),                    /*!< MFCOM clock */
    RCU_MCMUA     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 22U),                    /*!< MCMUA clock */
    RCU_MCMUB     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 23U),                    /*!< MCMUB clock */
    RCU_HWSEM     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 24U),                    /*!< HWSEM clock */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_HSMIF     = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 25U),                    /*!< HSMIF clock */
    RCU_FMU       = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 27U),                    /*!< FMU clock */
    RCU_IRM       = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 28U),                    /*!< IRM clock */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_IOC       = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 29U),                    /*!< IOC clock */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_STCM      = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 30U),                    /*!< STCM clock */
    RCU_MTC       = RCU_REGIDX_BIT(AHBEN_REG_OFFSET, 31U),                    /*!< MTC clock */
    /* APB2 peripherals */
    RCU_SYSCFG    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 0U),                    /*!< SYSCFG clock */
    RCU_LINFLEXD0 = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 1U),                    /*!< LINFlexD0 clock */
    RCU_LINFLEXD1 = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 2U),                    /*!< LINFlexD1 clock */
    RCU_LINFLEXD2 = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 3U),                    /*!< LINFlexD2 clock */
    RCU_LINFLEXD3 = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 4U),                    /*!< LINFlexD3 clock */
    RCU_LINFLEXD4 = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 5U),                    /*!< LINFlexD4 clock */
    RCU_LINFLEXD5 = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 6U),                    /*!< LINFlexD5 clock */
    RCU_TRIGSEL   = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 7U),                    /*!< TRIGSEL clock */
    RCU_ADC0      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 8U),                    /*!< ADC0 clock */
    RCU_ADC1      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 9U),                    /*!< ADC1 clock */
    RCU_TIMER0    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 10U),                   /*!< TIMER0 clock */
    RCU_SPI0      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 11U),                   /*!< SPI0 clock */
    RCU_TIMER7    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 12U),                   /*!< TIMER7 clock */
    RCU_SPI4      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 16U),                   /*!< SPI4 clock */
    RCU_SPI5      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 17U),                   /*!< SPI5 clock */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_ADC2      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 18U),                   /*!< ADC2 clock */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_TIMER19   = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 19U),                   /*!< TIMER19 clock */
    RCU_TIMER1    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 20U),                   /*!< TIMER1 clock */
    RCU_TIMER5    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 21U),                   /*!< TIMER5 clock */
    RCU_TIMER62   = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 22U),                   /*!< TIMER62 clock */
    RCU_CMP1      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 23U),                   /*!< CMP1 clock */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_SPI1      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 25U),                   /*!< SPI1 clock */
    RCU_CMP0      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 26U),                     /*!< CMP0 clock */

    /* APB1 peripherals */
    RCU_TIMER20   = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 0U),                    /*!< TIMER20 clock */
    RCU_TIMER2    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 1U),                    /*!< TIMER2 clock */
    RCU_TIMER60   = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 2U),                    /*!< TIMER60 clock */
    RCU_TIMER6    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 3U),                    /*!< TIMER6 clock */
    RCU_WWDGT0    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 4U),                    /*!< WWDGT0 clock */
    RCU_FWDGT0    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 5U),                    /*!< FWDGT0 clock */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_SPI6      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 6U),                    /*!< SPI6 clock */
    RCU_SPI7      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 7U),                    /*!< SPI7 clock */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_I2C0      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 10U),                   /*!< I2C0 clock */
    RCU_I2C1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 11U),                   /*!< I2C1 clock */
    RCU_BKP       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 12U),                   /*!< BKP clock */
    RCU_PMU       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 13U),                   /*!< PMU clock */
    RCU_DAC0      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 14U),                   /*!< DAC0 clock */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_ENET      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 15U),                   /*!< ENET clock */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_TIMER61   = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 16U),                   /*!< TIMER61 clock */
    RCU_TIMER63   = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 17U),                   /*!< TIMER63 clock */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_SENT      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 18U),                   /*!< SENT clock */
    RCU_LINFLEXD6      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 19U),                   /*!< RCU_LINFlexD6 clock */
    RCU_LINFLEXD7      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 20U),                   /*!< RCU_LINFlexD7 clock */
    RCU_LINFLEXD8      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 21U),                   /*!< RCU_LINFlexD8 clock */
    RCU_LINFLEXD9      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 22U),                   /*!< RCU_LINFlexD9 clock */
    RCU_LINFLEXD10     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 23U),                   /*!< RCU_LINFlexD10 clock */
    RCU_LINFLEXD11     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 24U),                   /*!< RCU_LINFlexD11 clock */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_DAC1      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 25U),                   /*!< DAC1 clock */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_WWDGT1    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 26U),                   /*!< WWDGT1 clock */
    RCU_FWDGT1    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 27U),                   /*!< FWDGT1 clock */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_SPI2      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 28U),                   /*!< SPI2 clock */
    RCU_SPI3      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 29U),                   /*!< SPI3 clock */
    RCU_CLTCFG    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 30U),                   /*!< CLTCFG clock */
    RCU_RTC       = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 15U),                    /*!< RTC clock */
    /* APB2_ADD peripherals */
    RCU_DTM_CAN0      = RCU_REGIDX_BIT(APB2EN_ADD_REG_OFFSET, 0U),            /*!< DTM_CAN0 clock */
    RCU_DTM_CAN1      = RCU_REGIDX_BIT(APB2EN_ADD_REG_OFFSET, 1U),            /*!< DTM_CAN1 clock */
    RCU_DTM_CAN2      = RCU_REGIDX_BIT(APB2EN_ADD_REG_OFFSET, 2U),            /*!< DTM_CAN2 clock */
    RCU_DTM_CAN3      = RCU_REGIDX_BIT(APB2EN_ADD_REG_OFFSET, 3U),            /*!< DTM_CAN3 clock */
    RCU_DTM_CAN4      = RCU_REGIDX_BIT(APB2EN_ADD_REG_OFFSET, 4U),            /*!< DTM_CAN4 clock */
    RCU_DTM_CAN5      = RCU_REGIDX_BIT(APB2EN_ADD_REG_OFFSET, 5U),            /*!< DTM_CAN5 clock */
    RCU_DTM_CAN6      = RCU_REGIDX_BIT(APB2EN_ADD_REG_OFFSET, 6U),            /*!< DTM_CAN6 clock */
    RCU_DTM_CAN7      = RCU_REGIDX_BIT(APB2EN_ADD_REG_OFFSET, 7U),            /*!< DTM_CAN7 clock */

    /* AHB_ADD peripherals */
    RCU_CM7_0      = RCU_REGIDX_BIT(AHBEN_ADD_REG_OFFSET, 0U),                /*!< CM7_0 clock */
#if defined (GD32A72XX) || defined (GD32A74XX)
    RCU_CM7_1      = RCU_REGIDX_BIT(AHBEN_ADD_REG_OFFSET, 1U),                /*!< CM7_1 clock */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
} rcu_periph_enum;

