sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* peripherals reset */
typedef enum {
    /* AHB peripherals */
    RCU_GPIOARST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 0U),                 /*!< GPIOA reset */
    RCU_GPIOBRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 1U),                 /*!< GPIOB reset */
    RCU_GPIOCRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 2U),                 /*!< GPIOC reset */
    RCU_GPIODRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 3U),                 /*!< GPIOD reset */
    RCU_GPIOERST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 4U),                 /*!< GPIOE reset */
    RCU_GPIOFRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 5U),                 /*!< GPIOF reset */
    RCU_GPIOGRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 6U),                 /*!< GPIOA reset */
    RCU_GPIOHRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 7U),                 /*!< GPIOB reset */
    RCU_GPIOIRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 8U),                 /*!< GPIOC reset */
    RCU_GPIOJRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 9U),                 /*!< GPIOD reset */
    RCU_GPIOKRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 10U),                /*!< GPIOE reset */
    RCU_GPIOLRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 11U),                /*!< GPIOF reset */
    RCU_GPIOMRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 12U),                /*!< GPIOE reset */
    RCU_GPIONRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 13U),                /*!< GPIOF reset */
    RCU_DMA0RST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 14U),                /*!< DMA0 reset */
    RCU_DMA1RST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 15U),                /*!< DMA1 reset */
    RCU_DMAMUXRST    = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 16U),                /*!< DMAMUX reset */
    RCU_QSPIRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 18U),                /*!< QSPI reset */
    RCU_CRCRST       = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 20U),                /*!< CRC reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_MFCOMRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 21U),                /*!< MFCOM reset */
    RCU_MCMUARST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 22U),                /*!< MCMUA reset */
    RCU_MCMUBRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 23U),                /*!< MCMUB reset */
    RCU_HWSEMRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 24U),                /*!< HWSEM reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_HSMIFRST     = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 25U),                /*!< HSMIF reset */
    RCU_IRMRST       = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 28U),                /*!< IRM reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_IOCRST       = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 29U),                /*!< IOC reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_STCMRST      = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 30U),                /*!< STCM reset */
    RCU_MTCRST       = RCU_REGIDX_BIT(AHBRST_REG_OFFSET, 31U),                /*!< MTC reset */
    /* APB2 peripherals */
    RCU_SYSCFGRST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 0U),                /*!< SYSCFG reset */
    RCU_LINFLEXD0RST = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 1U),                /*!< LINFlexD0 reset */
    RCU_LINFLEXD1RST = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 2U),                /*!< LINFlexD1 reset */
    RCU_LINFLEXD2RST = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 3U),                /*!< LINFlexD2 reset */
    RCU_LINFLEXD3RST = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 4U),                /*!< LINFlexD3 reset */
    RCU_LINFLEXD4RST = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 5U),                /*!< LINFlexD4 reset */
    RCU_LINFLEXD5RST = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 6U),                /*!< LINFlexD5 reset */
    RCU_ADC0RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 8U),                /*!< ADC0 reset */
    RCU_ADC1RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 9U),                /*!< ADC1 reset */
    RCU_TIMER0RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 10U),               /*!< TIMER0 reset */
    RCU_SPI0RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 11U),               /*!< SPI0 reset */
    RCU_TIMER7RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 12U),               /*!< TIMER7 reset */
    RCU_SPI4RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 16U),               /*!< SPI4 reset */
    RCU_SPI5RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 17U),               /*!< SPI5 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_ADC2RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 18U),               /*!< ADC2 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_TIMER19RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 19U),               /*!< TIMER19 reset */
    RCU_TIMER1RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 20U),               /*!< TIMER1 reset */
    RCU_TIMER5RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 21U),               /*!< TIMER5 reset */
    RCU_TIMER62RST   = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 22U),               /*!< TIMER62 reset */
    RCU_CMP1RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 23U),               /*!< CMP1 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_USART5RST    = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 24U),               /*!< USART5 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_SPI1RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 25U),               /*!< SPI1 reset */
    RCU_CMP0RST      = RCU_REGIDX_BIT(APB2RST_REG_OFFSET, 26U),               /*!< CMP0 reset */

    /* APB1 peripherals */
    RCU_TIMER20RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 0U),                /*!< TIMER20 reset */
    RCU_TIMER2RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 1U),                /*!< TIMER2 reset */
    RCU_TIMER60RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 2U),                /*!< TIMER60 reset */
    RCU_TIMER6RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 3U),                /*!< TIMER6 reset */
    RCU_WWDGT0RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 4U),                /*!< WWDGT0 reset */
    RCU_FWDGT0RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 5U),                /*!< FWDGT0 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_SPI6RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 6U),                /*!< SPI6 reset */
    RCU_SPI7RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 7U),                /*!< SPI7 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_I2C0RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 10U),               /*!< I2C0 reset */
    RCU_I2C1RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 11U),               /*!< I2C1 reset */
    RCU_BKPRST       = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 12U),               /*!< BKP reset */
    RCU_DAC0RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 14U),               /*!< DAC0 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_ENETRST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 15U),               /*!< ENET reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_TIMER61RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 16U),               /*!< TIMER61 reset */
    RCU_TIMER63RST   = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 17U),               /*!< TIMER63 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_SENTRST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 18U),               /*!< SENT reset */
    RCU_LINFLEXD6RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 19U),               /*!< RCU_LINFlexD6 reset */
    RCU_LINFLEXD7RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 20U),               /*!< RCU_LINFlexD7 reset */
    RCU_LINFLEXD8RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 21U),               /*!< RCU_LINFlexD8 reset */
    RCU_LINFLEXD9RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 22U),               /*!< RCU_LINFlexD9 reset */
    RCU_LINFLEXD10RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 23U),               /*!< RCU_LINFlexD10 reset */
    RCU_LINFLEXD11RST     = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 24U),               /*!< RCU_LINFlexD11 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_DAC1RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 25U),               /*!< DAC1 reset */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_WWDGT1RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 26U),               /*!< WWDGT1 reset */
    RCU_FWDGT1RST    = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 27U),               /*!< FWDGT1 reset */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_SPI2RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 28U),               /*!< SPI2 reset */
    RCU_SPI3RST      = RCU_REGIDX_BIT(APB1RST_REG_OFFSET, 29U),               /*!< SPI3 reset */
    /* APB2_ADD peripherals */
    RCU_CAN0RST      = RCU_REGIDX_BIT(APB2RST_ADD_REG_OFFSET, 8U),            /*!< CAN0 cluster reset */
    RCU_CAN1RST      = RCU_REGIDX_BIT(APB2RST_ADD_REG_OFFSET, 9U),            /*!< CAN1 cluster reset */
    RCU_CAN2RST      = RCU_REGIDX_BIT(APB2RST_ADD_REG_OFFSET, 10U),           /*!< CAN2 cluster reset */
} rcu_periph_reset_enum;

/* clock stabilization interrupt enable or disable */
typedef enum {
    RCU_INT_LXTALSTB           = RCU_REGIDX_BIT(INT_REG_OFFSET, 9U),         /*!< LXTAL stabilization interrupt enable */
    RCU_INT_HXTALSTB           = RCU_REGIDX_BIT(INT_REG_OFFSET, 11U),        /*!< HXTAL stabilization interrupt enable */
    RCU_INT_PLLSTB             = RCU_REGIDX_BIT(INT_REG_OFFSET, 12U),        /*!< PLL stabilization interrupt enable */
} rcu_int_enum;

