sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* POR watchdog overflow flag */
typedef enum {
    /* RCU_PORSTAT0 flag */
    RCU_FLAG_OVF0     = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 0U),                   /*!< PORWDG_OVF0 captures the status of subsystem reset sequence process SUBSRST0 when PORWDG overflows */
    RCU_FLAG_OVF1     = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 1U),                   /*!< PORWDG_OVF1 captures the status of subsystem reset sequence process SUBSRST1 when PORWDG overflows */
    RCU_FLAG_OVF2     = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 2U),                   /*!< PORWDG_OVF2 captures the status of subsystem reset sequence process SUBSRST2 when PORWDG overflows*/
    RCU_FLAG_OVF3     = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 3U),                   /*!< PORWDG_OVF3 captures the status of subsystem reset sequence process SUBSRST3 when PORWDG overflows*/
    RCU_FLAG_OVF4     = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 4U),                   /*!< PORWDG_OVF4 captures the status of subsystem reset sequence process SUBSRST4 when PORWDG overflows*/
    RCU_FLAG_OVF5     = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 5U),                   /*!< PORWDG_OVF5 captures the status of subsystem reset sequence process SUBSRST5 when PORWDG overflows*/
    RCU_FLAG_OVF6     = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 6U),                   /*!< PORWDG_OVF6 captures the status of subsystem reset sequence process SUBSRST6 when PORWDG overflows*/
    RCU_FLAG_OVF10    = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 10U),                  /*!< PORWDG_OVF10 captures the status of subsystem reset sequence process SUBSRST7 when PORWDG overflows*/
    RCU_FLAG_OVF11    = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 11U),                  /*!< PORWDG_OVF11 captures the status of subsystem reset sequence process SUBSRST8 when PORWDG overflows*/
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_FLAG_OVF14    = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 14U),                  /*!< PORWDG_OVF14 captures the status of subsystem reset sequence process SUBSRST9 when PORWDG overflows*/
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    RCU_FLAG_OVF20    = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 20U),                  /*!< PORWDG_OVF20 captures the status of subsystem reset sequence process SYSRST0 when PORWDG overflows*/
    RCU_FLAG_OVF29    = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 29U),                  /*!< PORWDG_OVF29 captures the status of standby entry request initiated by PMU when PORWDG overflows*/
    RCU_FLAG_OVF30    = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 30U),                  /*!< PORWDG_OVF30 captures the status of standby exit acknowledgement by PMU when POR_WDG overflows*/
    RCU_FLAG_OVF31    = RCU_REGIDX_BIT(PORSTAT0_REG_OFFSET, 31U),                  /*!< PORWDG_OVF31 captures RCTL reset event (if occurred) while the device is in standby mode*/
    /* RCU_PORSTAT1 flag */
    RCU_FLAG_OVF32   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 0U),                   /*!< PORWDG_OVF32 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[0]) */
    RCU_FLAG_OVF33   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 1U),                   /*!< PORWDG_OVF33 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[1]) */
    RCU_FLAG_OVF34   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 2U),                   /*!< PORWDG_OVF34 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[2]) */
    RCU_FLAG_OVF35   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 3U),                   /*!< PORWDG_OVF35 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[3]) */
    RCU_FLAG_OVF36   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 4U),                   /*!< PORWDG_OVF36 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[4]) */
    RCU_FLAG_OVF37   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 5U),                   /*!< PORWDG_OVF37 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[5]) */
    RCU_FLAG_OVF38   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 6U),                   /*!< PORWDG_OVF38 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[6]) */
    RCU_FLAG_OVF39   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 7U),                   /*!< PORWDG_OVF39 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[7]) */
    RCU_FLAG_OVF40   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 8U),                   /*!< PORWDG_OVF40 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[8]) */
    RCU_FLAG_OVF41   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 9U),                   /*!< PORWDG_OVF41 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[9]) */
    RCU_FLAG_OVF42   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 10U),                  /*!< PORWDG_OVF42 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[10]) */
    RCU_FLAG_OVF43   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 11U),                  /*!< PORWDG_OVF43 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[11]) */
    RCU_FLAG_OVF44   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 12U),                  /*!< PORWDG_OVF44 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[12]) */
    RCU_FLAG_OVF45   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 13U),                  /*!< PORWDG_OVF45 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[13]) */
    RCU_FLAG_OVF46   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 14U),                  /*!< PORWDG_OVF46 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[14]) */
    RCU_FLAG_OVF47   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 15U),                  /*!< PORWDG_OVF47 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[15]) */
    RCU_FLAG_OVF48   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 16U),                  /*!< PORWDG_OVF48 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[16]) */
    RCU_FLAG_OVF49   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 17U),                  /*!< PORWDG_OVF49 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[17]) */
    RCU_FLAG_OVF50   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 18U),                  /*!< PORWDG_OVF50 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[18]) */
    RCU_FLAG_OVF51   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 19U),                  /*!< PORWDG_OVF51 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[19]) */
    RCU_FLAG_OVF52   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 20U),                  /*!< PORWDG_OVF52 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[20]) */
    RCU_FLAG_OVF53   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 21U),                  /*!< PORWDG_OVF53 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[21]) */
    RCU_FLAG_OVF54   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 22U),                  /*!< PORWDG_OVF54 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[22]) */
    RCU_FLAG_OVF55   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 23U),                  /*!< PORWDG_OVF55 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[23]) */
    RCU_FLAG_OVF56   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 24U),                  /*!< PORWDG_OVF56 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[24]) */
    RCU_FLAG_OVF57   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 25U),                  /*!< PORWDG_OVF57 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[25]) */
    RCU_FLAG_OVF58   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 26U),                  /*!< PORWDG_OVF58 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[26]) */
    RCU_FLAG_OVF59   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 27U),                  /*!< PORWDG_OVF59 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[27]) */
    RCU_FLAG_OVF60   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 28U),                  /*!< PORWDG_OVF60 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[28]) */
    RCU_FLAG_OVF61   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 29U),                  /*!< PORWDG_OVF61 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[29]) */
    RCU_FLAG_OVF62   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 30U),                  /*!< PORWDG_OVF62 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[30]) */
    RCU_FLAG_OVF63   = RCU_REGIDX_BIT(PORSTAT1_REG_OFFSET, 31U),                  /*!< PORWDG_OVF63 captures RCTL subsystem/external event status register when PORWDG overflows (RCU_SUBSERSTAT[31]) */
    /* RCU_PORSTAT2 flag */
    RCU_FLAG_OVF64   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 0U),                   /*!< PORWDG_OVF64 captures RCTL system event status register when PORWDG overflows (RCU_SYSRSTSTAT[0]) */
    RCU_FLAG_OVF65   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 1U),                   /*!< PORWDG_OVF65 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[1]) */
    RCU_FLAG_OVF66   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 2U),                   /*!< PORWDG_OVF66 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[2]) */
    RCU_FLAG_OVF67   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 3U),                   /*!< PORWDG_OVF67 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[3]) */
    RCU_FLAG_OVF68   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 4U),                   /*!< PORWDG_OVF68 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[4]) */
    RCU_FLAG_OVF69   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 5U),                   /*!< PORWDG_OVF69 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[5]) */
    RCU_FLAG_OVF70   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 6U),                   /*!< PORWDG_OVF70 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[6]) */
    RCU_FLAG_OVF71   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 7U),                   /*!< PORWDG_OVF71 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[7]) */
    RCU_FLAG_OVF72   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 8U),                   /*!< PORWDG_OVF72 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[8]) */
    RCU_FLAG_OVF73   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 9U),                   /*!< PORWDG_OVF73 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[9]) */
    RCU_FLAG_OVF74   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 10U),                  /*!< PORWDG_OVF74 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[10]) */
    RCU_FLAG_OVF75   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 11U),                  /*!< PORWDG_OVF75 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[11]) */
    RCU_FLAG_OVF76   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 12U),                  /*!< PORWDG_OVF76 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[12]) */
    RCU_FLAG_OVF77   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 13U),                  /*!< PORWDG_OVF77 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[13]) */
    RCU_FLAG_OVF78   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 14U),                  /*!< PORWDG_OVF78 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[14]) */
    RCU_FLAG_OVF79   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 15U),                  /*!< PORWDG_OVF79 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[15]) */
    RCU_FLAG_OVF80   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 16U),                  /*!< PORWDG_OVF80 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[16]) */
    RCU_FLAG_OVF81   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 17U),                  /*!< PORWDG_OVF81 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[17]) */
    RCU_FLAG_OVF82   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 18U),                  /*!< PORWDG_OVF82 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[18]) */
    RCU_FLAG_OVF83   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 19U),                  /*!< PORWDG_OVF83 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[19]) */
    RCU_FLAG_OVF84   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 20U),                  /*!< PORWDG_OVF84 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[20]) */
    RCU_FLAG_OVF85   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 21U),                  /*!< PORWDG_OVF85 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[21]) */
    RCU_FLAG_OVF86   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 22U),                  /*!< PORWDG_OVF86 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[22]) */
    RCU_FLAG_OVF87   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 23U),                  /*!< PORWDG_OVF87 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[23]) */
    RCU_FLAG_OVF88   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 24U),                  /*!< PORWDG_OVF88 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[24]) */
    RCU_FLAG_OVF89   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 25U),                  /*!< PORWDG_OVF89 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[25]) */
    RCU_FLAG_OVF90   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 26U),                  /*!< PORWDG_OVF90 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[26]) */
    RCU_FLAG_OVF91   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 27U),                  /*!< PORWDG_OVF91 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[27]) */
    RCU_FLAG_OVF92   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 28U),                  /*!< PORWDG_OVF92 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[28]) */
    RCU_FLAG_OVF93   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 29U),                  /*!< PORWDG_OVF93 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[29]) */
    RCU_FLAG_OVF94   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 30U),                  /*!< PORWDG_OVF94 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[30]) */
    RCU_FLAG_OVF95   = RCU_REGIDX_BIT(PORSTAT2_REG_OFFSET, 31U),                  /*!< PORWDG_OVF95 captures the status of subsystem reset sequence process (RCU_SYSRSTSTAT[31]) */
    /* RCU_PORSTAT3 flag */                                                       
    RCU_FLAG_OVF96   = RCU_REGIDX_BIT(PORSTAT3_REG_OFFSET, 0U),                   /*!< PORWDG_OVF96 captures captures PORWDG reset event if PORWDG initiates a POR sequence */

} por_watchdog_overflow_flag_enum;

/* oscillator types */
typedef enum {
    RCU_HXTAL                  = RCU_REGIDX_BIT(CTL_REG_OFFSET, 16U),        /*!< HXTAL */
    RCU_LXTAL                  = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 0U),       /*!< LXTAL */
    RCU_PLL_CK                 = RCU_REGIDX_BIT(CTL_REG_OFFSET, 24U),        /*!< PLL */
} rcu_osci_type_enum;

/* rcu clock frequency */
typedef enum {
    CK_SYS      = 0,                                                         /*!< system clock */
    CK_AHB,                                                                  /*!< AHB clock */
    CK_APB1,                                                                 /*!< APB1 clock */
    CK_APB2,                                                                 /*!< APB2 clock */
    CK_LINFLEXD,                                                             /*!< LINFlexD clock */
} rcu_clock_freq_enum;

/* RCU_CTL register bit define */
/* HXTAL frequency scale select */
#define CTL0_HXTALSCAL(regval)          (BITS(22,23) & ((uint32_t)(regval) << 22))
#define HXTAL_SCALE_4M_TO_8M            CTL0_HXTALSCAL(0)                    /*!< HXTAL scale is 2M-8MHz */
#define HXTAL_SCALE_8M_TO_16M           CTL0_HXTALSCAL(1)                    /*!< HXTAL scale is 8M-16MHz */
#define HXTAL_SCALE_16M_TO_32M          CTL0_HXTALSCAL(2)                    /*!< HXTAL scale is 16M-32MHz */
#define HXTAL_SCALE_32M_TO_40M          CTL0_HXTALSCAL(3)                    /*!< HXTAL scale is 32M-40MHz */

/* RCU_CFG0 register bit define */
/* system clock source select */
#define CFG0_SCS(regval)                (BITS(0,1) & ((uint32_t)(regval) << 0))
#define RCU_CKSYSSRC_IRC48M             CFG0_SCS(0)                          /*!< system clock source select IRC48M */
#define RCU_CKSYSSRC_HXTAL              CFG0_SCS(1)                          /*!< system clock source select HXTAL */
#define RCU_CKSYSSRC_PLLP               CFG0_SCS(2)                          /*!< system clock source select PLLP */

/* system clock source select status */
#define CFG0_SCSS(regval)               (BITS(2,3) & ((uint32_t)(regval) << 2))
#define RCU_SCSS_IRC48M                 CFG0_SCSS(0)                         /*!< system clock source select IRC48M */
#define RCU_SCSS_HXTAL                  CFG0_SCSS(1)                         /*!< system clock source select HXTAL */
#define RCU_SCSS_PLL_P                  CFG0_SCSS(2)                         /*!< system clock source select PLL_P */

/* AHB prescaler selection */
#define CFG0_AHBPSC(regval)             (BITS(4,7) & ((uint32_t)(regval) << 4))
#define RCU_AHB_CKSYS_DIV1              CFG0_AHBPSC(0)                       /*!< AHB prescaler select CK_SYS */
#define RCU_AHB_CKSYS_DIV2              CFG0_AHBPSC(8)                       /*!< AHB prescaler select CK_SYS/2 */
#define RCU_AHB_CKSYS_DIV4              CFG0_AHBPSC(9)                       /*!< AHB prescaler select CK_SYS/4 */
#define RCU_AHB_CKSYS_DIV8              CFG0_AHBPSC(10)                      /*!< AHB prescaler select CK_SYS/8 */
#define RCU_AHB_CKSYS_DIV16             CFG0_AHBPSC(11)                      /*!< AHB prescaler select CK_SYS/16 */
#define RCU_AHB_CKSYS_DIV64             CFG0_AHBPSC(12)                      /*!< AHB prescaler select CK_SYS/64 */
#define RCU_AHB_CKSYS_DIV128            CFG0_AHBPSC(13)                      /*!< AHB prescaler select CK_SYS/128 */
#define RCU_AHB_CKSYS_DIV256            CFG0_AHBPSC(14)                      /*!< AHB prescaler select CK_SYS/256 */
#define RCU_AHB_CKSYS_DIV512            CFG0_AHBPSC(15)                      /*!< AHB prescaler select CK_SYS/512 */

/* APB1 prescaler selection */
#define CFG0_APB1PSC(regval)            (BITS(8,10) & ((uint32_t)(regval) << 8))
#define RCU_APB1_CKAHB_DIV1             CFG0_APB1PSC(0)                      /*!< APB1 prescaler select CK_AHB */
#define RCU_APB1_CKAHB_DIV2             CFG0_APB1PSC(4)                      /*!< APB1 prescaler select CK_AHB/2 */
#define RCU_APB1_CKAHB_DIV4             CFG0_APB1PSC(5)                      /*!< APB1 prescaler select CK_AHB/4 */
#define RCU_APB1_CKAHB_DIV8             CFG0_APB1PSC(6)                      /*!< APB1 prescaler select CK_AHB/8 */
#define RCU_APB1_CKAHB_DIV16            CFG0_APB1PSC(7)                      /*!< APB1 prescaler select CK_AHB/16 */

/* APB2 prescaler selection */
#define CFG0_APB2PSC(regval)            (BITS(11,13) & ((uint32_t)(regval) << 11))
#define RCU_APB2_CKAHB_DIV1             CFG0_APB2PSC(0)                      /*!< APB2 prescaler select CK_AHB */
#define RCU_APB2_CKAHB_DIV2             CFG0_APB2PSC(4)                      /*!< APB2 prescaler select CK_AHB/2 */
#define RCU_APB2_CKAHB_DIV4             CFG0_APB2PSC(5)                      /*!< APB2 prescaler select CK_AHB/4 */
#define RCU_APB2_CKAHB_DIV8             CFG0_APB2PSC(6)                      /*!< APB2 prescaler select CK_AHB/8 */
#define RCU_APB2_CKAHB_DIV16            CFG0_APB2PSC(7)                      /*!< APB2 prescaler select CK_AHB/16 */

/* APB2 prescaler selection */
#define PLLMF_7                         RCU_CFG0_PLLMF_7                     /*!< bit 7 of PLLMF */
#define CFG0_PLLMF(regval)              (BITS(17,23) & ((uint32_t)(regval) << 17))
#define PLLMF(x)                        ((x > 0x7FU) ? (PLLMF_7 | CFG0_PLLMF(x & 0x7FU)) : (CFG0_PLLMF(x)))

/* CKOUT1 Clock source selection */
#define CFG0_CKOUT1SEL(regval)          (BITS(24,26) & ((uint32_t)(regval) << 24))
#define RCU_CKOUT1SRC_IRC48M            CFG0_CKOUT1SEL(0)                     /*!< IRC48M clock is selected as CK_OUT1 clock source */
#define RCU_CKOUT1SRC_HXTAL             CFG0_CKOUT1SEL(1)                     /*!< HXTAL is selected as CK_OUT1 clock source */
#define RCU_CKOUT1SRC_IRC40K            CFG0_CKOUT1SEL(2)                     /*!< IRC40K is selected as CK_OUT1 clock source */
#define RCU_CKOUT1SRC_LXTAL             CFG0_CKOUT1SEL(3)                     /*!< LXTAL clock is selected as CK_OUT1 clock source */
#define RCU_CKOUT1SRC_CKAPB2            CFG0_CKOUT1SEL(4)                     /*!< CK_APB2 is selected as CK_OUT1 clock source */

/* CK_OUT1 divider */
#define CFG0_CKOUT1DIV(regval)           (BITS(28,30) & ((uint32_t)(regval) << 28))
#define RCU_CKOUT1_DIV1                  CFG0_CKOUT1DIV(0)                     /*!< CK_OUT1 is divided by 1 */
#define RCU_CKOUT1_DIV2                  CFG0_CKOUT1DIV(1)                     /*!< CK_OUT1 is divided by 2 */
#define RCU_CKOUT1_DIV4                  CFG0_CKOUT1DIV(2)                     /*!< CK_OUT1 is divided by 4 */
#define RCU_CKOUT1_DIV8                  CFG0_CKOUT1DIV(3)                     /*!< CK_OUT1 is divided by 8 */
#define RCU_CKOUT1_DIV16                 CFG0_CKOUT1DIV(4)                     /*!< CK_OUT1 is divided by 16 */
#define RCU_CKOUT1_DIV32                 CFG0_CKOUT1DIV(5)                     /*!< CK_OUT1 is divided by 32 */
#define RCU_CKOUT1_DIV64                 CFG0_CKOUT1DIV(6)                     /*!< CK_OUT1 is divided by 64 */
#define RCU_CKOUT1_DIV128                CFG0_CKOUT1DIV(7)                     /*!< CK_OUT1 is divided by 128 */

/* The CK_PLL divide by 1 or 2 for CK_OUT0 */
#define CFG0_PLLDV(regval)              (BIT(31) & ((uint32_t)(regval) << 31))

