sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* RCU_CFG1 register bit define */
/* PREDV division factor */
#define CFG1_PREDV(regval)              (BITS(0,2) & ((uint32_t)(regval) << 0))
#define RCU_PREDV_DIV1                  CFG1_PREDV(0)                        /*!< PREDV input clock source not divided */
#define RCU_PREDV_DIV2                  CFG1_PREDV(2)                        /*!< PREDV input clock source divided by 2 */
#define RCU_PREDV_DIV3                  CFG1_PREDV(3)                        /*!< PREDV input clock source divided by 3 */
#define RCU_PREDV_DIV4                  CFG1_PREDV(4)                        /*!< PREDV input clock source divided by 4 */
#define RCU_PREDV_DIV5                  CFG1_PREDV(5)                        /*!< PREDV input clock source divided by 5 */
#define RCU_PREDV_DIV6                  CFG1_PREDV(6)                        /*!< PREDV input clock source divided by 6 */
#define RCU_PREDV_DIV7                  CFG1_PREDV(7)                        /*!< PREDV input clock source divided by 7 */

/* The PLLQ clock prescaler */
#define RCU_PLLQPSC_DIV_MIN          ((uint32_t)1U)                          /*!< PLLQPSC_DIV min value */
#define RCU_PLLQPSC_DIV_MAX          ((uint32_t)64U)                         /*!< PLLQPSC_DIV max value */

/* The PLLP clock prescaler */
#define RCU_PLLPPSC_DIV_MIN          ((uint32_t)1U)                          /*!< PLLPPSC_DIV min value */
#define RCU_PLLPPSC_DIV_MAX          ((uint32_t)64U)                         /*!< PLLPPSC_DIV max value */

/* FWDGT clock source selection */
#define CFG1_FWDGTSRC(regval)          (BIT(0) & ((uint32_t)(regval)))
#define RCU_FWDGTSRC_IRC40K             CFG1_FWDGTSRC(0)                    /*!< IRC40K is selected as FWDGT clock source */
#define RCU_FWDGTSRC_LXTAL              CFG1_FWDGTSRC(1)                    /*!< LXTAL is selected as FWDGT clock source */

/* IRC48M response fail configuration */
#define RCU_IRC48M_POR                   0U                                 /*!< IRC48M fail response,POR reset is triggered */
#define RCU_FFIO0_FFIO1                  1U                                 /*!< the failure of IRC48M will set FFIO0 and FFIO1 pins to High-Z state */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* MFCOM prescaler select */
#define CFG1_MFCOMPSC(regval)           (BITS(28,29) & ((uint32_t)(regval) << 28))
#define RCU_CKMFCOM_CKAHB_DIV1          CFG1_MFCOMPSC(0)                       /*!< MFCOM prescaler select CK_AHB */
#define RCU_CKMFCOM_CKAHB_DIV2          CFG1_MFCOMPSC(1)                       /*!< MFCOM prescaler select CK_AHB/2 */
#define RCU_CKMFCOM_CKAHB_DIV4          CFG1_MFCOMPSC(2)                       /*!< MFCOM prescaler select CK_AHB/4 */
#define RCU_CKMFCOM_CKAHB_DIV8          CFG1_MFCOMPSC(3)                       /*!< MFCOM prescaler select CK_AHB/8 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* AIT clock source select */
#define CFG1_AITSRC(regval)             (BITS(26,27) & ((uint32_t)(regval) << 26))
#define RCU_CKAITSRC_IRC48M             CFG1_AITSRC(0)                         /*!< AIT clock source select CK_IRC48M */
#define RCU_CKAITSRC_CK_PLL_Q_DIV2      CFG1_AITSRC(1)                         /*!< AIT clock source select CK_PLL_Q/2 */
#define RCU_CKAITSRC_CK_PLL_Q_DIV3      CFG1_AITSRC(2)                         /*!< AIT clock source select CK_PLL_Q/3 */
#define RCU_CKAITSRC_CK_PLL_Q_DIV4      CFG1_AITSRC(3)                         /*!< AIT clock source select CK_PLL_Q/4 */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* ATE clock source select */
#define CFG1_ATESRC(regval)             (BITS(24,25) & ((uint32_t)(regval) << 24))
#define RCU_CKATESRC_IRC48M             CFG1_ATESRC(0)                         /*!< ATE clock source select IRC48M */
#define RCU_CKATESRC_CK_PLL_Q_DIV2      CFG1_ATESRC(1)                         /*!< ATE clock source select CK_PLL_Q/2 */
#define RCU_CKATESRC_CK_PLL_Q_DIV3      CFG1_ATESRC(2)                         /*!< ATE clock source select CK_PLL_Q/3 */
#define RCU_CKATESRC_CK_PLL_Q_DIV4      CFG1_ATESRC(3)                         /*!< ATE clock source select CK_PLL_Q/4 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* ADC prescaler select */
#define CFG2_ADCPSC(regval)             (BITS(27,31) & ((uint32_t)(regval) << 27))
#define RCU_CKADC_DIV2                  CFG2_ADCPSC(0)                       /*!< ADC prescaler select CK_ADC/2 */
#define RCU_CKADC_DIV3                  CFG2_ADCPSC(2)                       /*!< ADC prescaler select CK_ADC/3 */
#define RCU_CKADC_DIV4                  CFG2_ADCPSC(3)                       /*!< ADC prescaler select CK_ADC/4 */
#define RCU_CKADC_DIV5                  CFG2_ADCPSC(4)                       /*!< ADC prescaler select CK_ADC/5 */
#define RCU_CKADC_DIV6                  CFG2_ADCPSC(5)                       /*!< ADC prescaler select CK_ADC/6 */
#define RCU_CKADC_DIV7                  CFG2_ADCPSC(6)                       /*!< ADC prescaler select CK_ADC/7 */
#define RCU_CKADC_DIV8                  CFG2_ADCPSC(7)                       /*!< ADC prescaler select CK_ADC/8 */
#define RCU_CKADC_DIV9                  CFG2_ADCPSC(8)                       /*!< ADC prescaler select CK_ADC/9 */
#define RCU_CKADC_DIV10                 CFG2_ADCPSC(9)                       /*!< ADC prescaler select CK_ADC/10 */
#define RCU_CKADC_DIV11                 CFG2_ADCPSC(10)                      /*!< ADC prescaler select CK_ADC/11 */
#define RCU_CKADC_DIV12                 CFG2_ADCPSC(11)                      /*!< ADC prescaler select CK_ADC/12 */
#define RCU_CKADC_DIV13                 CFG2_ADCPSC(12)                      /*!< ADC prescaler select CK_ADC/13 */
#define RCU_CKADC_DIV14                 CFG2_ADCPSC(13)                      /*!< ADC prescaler select CK_ADC/14 */
#define RCU_CKADC_DIV15                 CFG2_ADCPSC(14)                      /*!< ADC prescaler select CK_ADC/15 */
#define RCU_CKADC_DIV16                 CFG2_ADCPSC(15)                      /*!< ADC prescaler select CK_ADC/16 */
#define RCU_CKADC_DIV17                 CFG2_ADCPSC(16)                      /*!< ADC prescaler select CK_ADC/17 */
#define RCU_CKADC_DIV18                 CFG2_ADCPSC(17)                      /*!< ADC prescaler select CK_ADC/18 */
#define RCU_CKADC_DIV19                 CFG2_ADCPSC(18)                      /*!< ADC prescaler select CK_ADC/19 */
#define RCU_CKADC_DIV20                 CFG2_ADCPSC(19)                      /*!< ADC prescaler select CK_ADC/20 */
#define RCU_CKADC_DIV21                 CFG2_ADCPSC(20)                      /*!< ADC prescaler select CK_ADC/21 */
#define RCU_CKADC_DIV22                 CFG2_ADCPSC(21)                      /*!< ADC prescaler select CK_ADC/22 */
#define RCU_CKADC_DIV23                 CFG2_ADCPSC(22)                      /*!< ADC prescaler select CK_ADC/23 */
#define RCU_CKADC_DIV24                 CFG2_ADCPSC(23)                      /*!< ADC prescaler select CK_ADC/24 */
#define RCU_CKADC_DIV25                 CFG2_ADCPSC(24)                      /*!< ADC prescaler select CK_ADC/25 */
#define RCU_CKADC_DIV26                 CFG2_ADCPSC(25)                      /*!< ADC prescaler select CK_ADC/26 */
#define RCU_CKADC_DIV27                 CFG2_ADCPSC(26)                      /*!< ADC prescaler select CK_ADC/27 */
#define RCU_CKADC_DIV28                 CFG2_ADCPSC(27)                      /*!< ADC prescaler select CK_ADC/28 */
#define RCU_CKADC_DIV29                 CFG2_ADCPSC(28)                      /*!< ADC prescaler select CK_ADC/29 */
#define RCU_CKADC_DIV30                 CFG2_ADCPSC(29)                      /*!< ADC prescaler select CK_ADC/30 */
#define RCU_CKADC_DIV31                 CFG2_ADCPSC(30)                      /*!< ADC prescaler select CK_ADC/31 */
#define RCU_CKADC_DIV32                 CFG2_ADCPSC(31)                      /*!< ADC prescaler select CK_ADC/32 */

/* PLL clock source selection */
#define RCU_PLLSRC_IRC48M              ((uint32_t)0x00000000U)               /*!< IRC48M clock is selected as clock source of PLL */
#define RCU_PLLSRC_HXTAL                RCU_CFG0_PLLSEL                      /*!< HXTAL is selected as clock source of PLL */

