sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* CKOUT0 Clock source selection */
#define CFG1_CKOUT0SEL(regval)           (BITS(16,19) & ((uint32_t)(regval) << 16))
#define RCU_CKOUT0SRC_CORECK             CFG1_CKOUT0SEL(0)                     /*!< Core clock is selected */
#define RCU_CKOUT0SRC_CKAPB1             CFG1_CKOUT0SEL(1)                     /*!< CK_APB1 is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_IRC40K             CFG1_CKOUT0SEL(2)                     /*!< IRC40K is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_LXTAL              CFG1_CKOUT0SEL(3)                     /*!< LXTAL clock is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_CKSYS              CFG1_CKOUT0SEL(4)                     /*!< CK_SYS is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_IRC48M             CFG1_CKOUT0SEL(5)                     /*!< IRC48M is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_HXTAL              CFG1_CKOUT0SEL(6)                     /*!< HXTAL is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_CKPLLP             CFG1_CKOUT0SEL(7)                     /*!< CK_PLLP clock is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_CKPLLP_DIV2        (CFG1_CKOUT0SEL(7) | BIT(31))         /*!< CK_PLL/2 is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_CKAPB2             CFG1_CKOUT0SEL(9)                     /*!< CK_APB2 is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_HSMPCLK            CFG1_CKOUT0SEL(10)                    /*!< HSM_PCLK clock is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_HSMHCLK            CFG1_CKOUT0SEL(11)                    /*!< HSM_HCLK is selected as CK_OUT0 clock source */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_CKOUT0SRC_CKENETRX           CFG1_CKOUT0SEL(12)                    /*!< CK_ENETRX is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_CKENETTX           CFG1_CKOUT0SEL(13)                    /*!< CK_ENETTX is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_CKENETMACRMI       CFG1_CKOUT0SEL(14)                    /*!< CK_ENETMACRMI clock is selected as CK_OUT0 clock source */
#define RCU_CKOUT0SRC_CKENETTS           CFG1_CKOUT0SEL(15)                    /*!< CK_ENETTS is selected as CK_OUT0 clock source */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* CK_OUT0 divider */
#define CFG1_CKOUT0DIV(regval)           (BITS(20,22) & ((uint32_t)(regval) << 20))
#define RCU_CKOUT0_DIV1                  CFG1_CKOUT0DIV(0)                     /*!< CK_OUT0 is divided by 1 */
#define RCU_CKOUT0_DIV2                  CFG1_CKOUT0DIV(1)                     /*!< CK_OUT0 is divided by 2 */
#define RCU_CKOUT0_DIV4                  CFG1_CKOUT0DIV(2)                     /*!< CK_OUT0 is divided by 4 */
#define RCU_CKOUT0_DIV8                  CFG1_CKOUT0DIV(3)                     /*!< CK_OUT0 is divided by 8 */
#define RCU_CKOUT0_DIV16                 CFG1_CKOUT0DIV(4)                     /*!< CK_OUT0 is divided by 16 */
#define RCU_CKOUT0_DIV32                 CFG1_CKOUT0DIV(5)                     /*!< CK_OUT0 is divided by 32 */
#define RCU_CKOUT0_DIV64                 CFG1_CKOUT0DIV(6)                     /*!< CK_OUT0 is divided by 64 */
#define RCU_CKOUT0_DIV128                CFG1_CKOUT0DIV(7)                     /*!< CK_OUT0 is divided by 128 */

/* LXTAL drive capability */
#define BDCTL_LXTALDRI(regval)           (BITS(3,4) & ((uint32_t)(regval) << 3))
#define RCU_LXTAL_LOWDRI                 BDCTL_LXTALDRI(0)                    /*!< lower driving capability */
#define RCU_LXTAL_MED_LOWDRI             BDCTL_LXTALDRI(1)                    /*!< medium low driving capability */
#define RCU_LXTAL_MED_HIGHDRI            BDCTL_LXTALDRI(2)                    /*!< medium high driving capability */
#define RCU_LXTAL_HIGHDRI                BDCTL_LXTALDRI(3)                    /*!< higher driving capability */

/* RTC clock entry selection */
#define BDCTL_RTCSRC(regval)             (BITS(8,9) & ((uint32_t)(regval) << 8))
#define RCU_RTCSRC_NONE                  BDCTL_RTCSRC(0)                     /*!< no clock is selected */
#define RCU_RTCSRC_LXTAL                 BDCTL_RTCSRC(1)                     /*!< LXTAL is selected as RTC clock source */
#define RCU_RTCSRC_IRC40K                BDCTL_RTCSRC(2)                     /*!< IRC40K is selected as RTC clock source */
#define RCU_RTCSRC_HXTAL_DIV_128         BDCTL_RTCSRC(3)                     /*!< HXTAL/128 is selected as RTC clock source */

/* ADC clock source selection */
#define CFG2_ADCSRC(regval)              (BITS(24,25) & ((uint32_t)(regval) << 24))
#define RCU_ADCSRC_HCLK                  CFG2_ADCSRC(0)                    /*!< HCLK is selected as ADC clock source */
#define RCU_ADCSRC_SYS                   CFG2_ADCSRC(1)                    /*!< CK_SYS is selected as ADC clock source */
#define RCU_ADCSRC_PLLP                  CFG2_ADCSRC(3)                    /*!< PLLP is selected as ADC clock source */

/* SPI clock source selection */
#define CFG3_SPISRC(regval)              (BITS(0,1) & ((uint32_t)(regval)))
#define RCU_SPISRC_APB1                  CFG3_SPISRC(0)                    /*!< CK_APB1 is selected as SPI clock source */
#define RCU_SPISRC_APB2                  CFG3_SPISRC(1)                    /*!< CK_APB2 is selected as SPI clock source */
#define RCU_SPISRC_IRC48M                CFG3_SPISRC(2)                    /*!< CK_IRC48M is selected as SPI clock source */
#define RCU_SPISRC_AHB                   CFG3_SPISRC(3)                    /*!< CK_AHB is selected as SPI clock source */

/* DTM_CAN clock source selection */
#define CFG2_DTM_CAN0SRC(regval)             (BITS(2,3) & ((uint32_t)(regval) << 2))
#define RCU_DTM_CANSRC_HXTAL                 CFG2_DTM_CAN0SRC(3)                      /*!< CK_HXTAL is selected as DTM_CAN clock source */
#define RCU_DTM_CANSRC_AHB                   CFG2_DTM_CAN0SRC(2)                      /*!< AHB is selected as DTM_CAN clock source */
#define RCU_DTM_CANSRC_PCLK2                 CFG2_DTM_CAN0SRC(1)                      /*!< PCLK2 is selected as DTM_CAN clock source */
#define RCU_DTM_CANSRC_IRC48M                CFG2_DTM_CAN0SRC(0)                      /*!< IRC48M is selected as DTM_CAN clock source */

