sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* TRACE clock source selection */
#define CFG3_TRACESRC(regval)            (BITS(30,31) & ((uint32_t)(regval) << 30))
#define RCU_TRACESRC_PLLQ                CFG3_TRACESRC(3)                      /*!< PLLQ is selected as TRACE clock source */
#define RCU_TRACESRC_PLLP                CFG3_TRACESRC(2)                      /*!< PLLP is selected as TRACE clock source */
#define RCU_TRACESRC_HXTAL               CFG3_TRACESRC(1)                      /*!< HXTAL is selected as TRACE clock source */
#define RCU_TRACESRC_IRC48M              CFG3_TRACESRC(0)                      /*!< IRC48M is selected as TRACE clock source */

/* QSPI clock source selection */
#define CFG3_QSPISRC(regval)             (BITS(25,26) & ((uint32_t)(regval) << 25))
#define RCU_QSPISRC_IRC48M               CFG3_QSPISRC(0)                      /*!< IRC48M is selected as QSPI clock source */
#define RCU_QSPISRC_HCLK                 CFG3_QSPISRC(1)                      /*!< HCLK is selected as QSPI clock source */
#define RCU_QSPISRC_PLLP                 CFG3_QSPISRC(2)                      /*!< PLLP is selected as QSPI clock source */
#define RCU_QSPISRC_PLLQ                 CFG3_QSPISRC(3)                      /*!< PLLQ is selected as QSPI clock source */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* ENETTS clock source selection */
#define CFG3_ENETTSSRC(regval)           (BITS(22,24) & ((uint32_t)(regval) << 22))
#define RCU_ENETTSSRC_CK_ENETTX          CFG3_ENETTSSRC(4)                    /*!< CK_ENETTX is selected as ENETTS clock source */
#define RCU_ENETTSSRC_CK_ENETRX          CFG3_ENETTSSRC(3)                    /*!< CK_ENETRX is selected as ENETTS clock source */
#define RCU_ENETTSSRC_PLLP               CFG3_ENETTSSRC(2)                    /*!< PLLP is selected as ENETTS clock source */
#define RCU_ENETTSSRC_HXTAL              CFG3_ENETTSSRC(1)                    /*!< HXTAL is selected as ENETTS clock source */
#define RCU_ENETTSSRC_IRC48M             CFG3_ENETTSSRC(0)                    /*!< IRC48M is selected as ENETTS clock source */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* WWDGT clock source selection */
#define CFG3_WWDGT0SRC(regval)           (BITS(16,18) & ((uint32_t)(regval) << 16))
#define RCU_WWDGTSRC_IRC48M              CFG3_WWDGT0SRC(0)                  /*!< CK_HXTAL is selected as WWDGT0 clock source */
#define RCU_WWDGTSRC_LXTAL               CFG3_WWDGT0SRC(1)                  /*!< LXTAL is selected as WWDGT0 clock source */
#define RCU_WWDGTSRC_IRC40K              CFG3_WWDGT0SRC(2)                  /*!< IRC40K is selected as WWDGT0 clock source */
#define RCU_WWDGTSRC_HXTAL               CFG3_WWDGT0SRC(3)                  /*!< HXTAL is selected as WWDGT0 clock source */
#define RCU_WWDGTSRC_CKSYS               CFG3_WWDGT0SRC(4)                  /*!< CK_SYS is selected as WWDGT0 clock source */
#define RCU_WWDGTSRC_PCLK1               CFG3_WWDGT0SRC(5)                  /*!< PCLK1 is selected as WWDGT0 clock source */

/* LINFlexD clock source selection */
#define CFG3_LINFLEXDSRC(regval)         (BITS(14,15) & ((uint32_t)(regval) << 14))
#define RCU_LINFLEXDSRC_CKSYS            CFG3_LINFLEXDSRC(3)                /*!< CK_SYS is selected as LINFlexD clock source */
#define RCU_LINFLEXDSRC_PLL_P            CFG3_LINFLEXDSRC(2)                /*!< PLL_P is selected as LINFlexD clock source */
#define RCU_LINFLEXDSRC_HXTAL            CFG3_LINFLEXDSRC(1)                /*!< HXTAL is selected as LINFlexD clock source */
#define RCU_LINFLEXDSRC_IRC48M           CFG3_LINFLEXDSRC(0)                /*!< IRC48M is selected as LINFlexD clock source */

/* TRACE clock source selection */
#define CFG3_TRACEDIV(regval)            (BITS(27,29) & ((uint32_t)(regval) << 27))
#define RCU_CKTRACE_DIV1                 CFG3_TRACEDIV(0)                      /*!< CK_TRACE is not divided */
#define RCU_CKTRACE_DIV2                 CFG3_TRACEDIV(1)                      /*!< CK_TRACE is divided by 2 */
#define RCU_CKTRACE_DIV3                 CFG3_TRACEDIV(2)                      /*!< CK_TRACE is divided by 3 */
#define RCU_CKTRACE_DIV4                 CFG3_TRACEDIV(3)                      /*!< CK_TRACE is divided by 4 */
#define RCU_CKTRACE_DIV5                 CFG3_TRACEDIV(4)                      /*!< CK_TRACE is divided by 5*/
#define RCU_CKTRACE_DIV6                 CFG3_TRACEDIV(5)                      /*!< CK_TRACE is divided by 6 */
#define RCU_CKTRACE_DIV7                 CFG3_TRACEDIV(6)                      /*!< CK_TRACE is divided by 7 */
#define RCU_CKTRACE_DIV8                 CFG3_TRACEDIV(7)                      /*!< CK_TRACE is divided by 8 */

/* adjust the PLL loss of lock accuracy */
#define PLLLOL_PLLLOLCTL(regval)         (BITS(0,1) & ((uint32_t)(regval)))
#define RCU_PLLLOL_UNLOCK_RANGE_1        PLLLOL_PLLLOLCTL(0)                   /*!< Unlock range = expected value(100) �� 5 */
#define RCU_PLLLOL_UNLOCK_RANGE_2        PLLLOL_PLLLOLCTL(1)                   /*!< Unlock range = expected value(100) �� 9 */
#define RCU_PLLLOL_UNLOCK_RANGE_3        PLLLOL_PLLLOLCTL(2)                   /*!< Unlock range = expected value(100) �� 17 */
#define RCU_PLLLOL_UNLOCK_RANGE_4        PLLLOL_PLLLOLCTL(3)                   /*!< Unlock range = expected value(100) �� 33 */

/* adjust the PLL loss of lock accuracy */
#define PLLSSCTL_SS_TYPE(regval)         (BIT(30) & ((uint32_t)(regval)<< 30))
#define RCU_SS_TYPE_CENTER               PLLSSCTL_SS_TYPE(0)                /*!< enter spread type is selected */
#define RCU_SS_TYPE_DOWN                 PLLSSCTL_SS_TYPE(1)                /*!< down spread type is selected */

/* RCTL flag definitions */
/* RCTL system reset flag definitions */
#define RCU_FLAG_POR                          RCU_SYSRSTSTAT_PORF                                 /*!< Power-on reset flag */
#define RCU_FLAG_FMU_REA_FAIL                 RCU_SYSRSTSTAT_FMU_REA_FAIL                         /*!< System reset flag FMU_REA_FAIL */
#define RCU_FLAG_STCM_REC_FAIL                RCU_SYSRSTSTAT_STCM_REC_FAIL                        /*!< System reset flag STCM_REC_FAIL */
#define RCU_FLAG_RCTL_SUBSRU                  RCU_SYSRSTSTAT_RCTL_SUBSRUF                         /*!< System reset flag RCTL_SUBSRUF */
#define RCU_FLAG_LOHRST                       RCU_SYSRSTSTAT_LOHRSTF                              /*!< Lost of HXTAL error reset flag */
#define RCU_FLAG_LOPRST                       RCU_SYSRSTSTAT_LOPRSTF                              /*!< Lost of PLL error reset flag */
#define RCU_FLAG_CORE_CK_FAIL                 RCU_SYSRSTSTAT_CORE_CK_FAIL                         /*!< Core clock fail reset flag */
#define RCU_FLAG_SYS_CK_FAIL                  RCU_SYSRSTSTAT_SYS_CK_FAIL                          /*!< CK_SYS fail reset flag */
#define RCU_FLAG_HSM_SYSRST                   RCU_SYSRSTSTAT_HSM_SYS_RSTF                         /*!< System reset flag HSM_SYS_RSTF */
#define RCU_FLAG_SW_SYSRST                    RCU_SYSRSTSTAT_SW_SYS_RSTF                          /*!< System reset flag SW_SYS_RSTF */
#define RCU_FLAG_DBG_SYSRST                   RCU_SYSRSTSTAT_DBG_SYS_RSTF                         /*!< System reset flag DBG_SYS_RSTF */
/* RCTL subsystem reset flag definitions */
#define RCU_FLAG_EXTRST                       RCU_SUBSERSTAT_EXRF                                 /*!< External reset flag EXRF */
#define RCU_FLAG_OBSTDBY                      RCU_SUBSERSTAT_OBSTDBY_RSTF                         /*!< Subsystem reset flag OBSTDBY_RSTF */
#define RCU_FLAG_FMU                          RCU_SUBSERSTAT_FMU_RSTF                             /*!< Subsystem reset flag FMU_RSTF */
#define RCU_FLAG_ST_FINISH                    RCU_SUBSERSTAT_ST_FINISH                            /*!< Subsystem reset flag ST_FINISH */
#define RCU_FLAG_FWDGT0                       RCU_SUBSERSTAT_FWDGT0_RSTF                          /*!< Subsystem reset flag FWDGT0_RSTF */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_FLAG_FWDGT1                       RCU_SUBSERSTAT_FWDGT1_RSTF                          /*!< Subsystem reset flag FWDGT1_RSTF */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_FLAG_SWRST                        RCU_SUBSERSTAT_SWRSTF                               /*!< Software reset flag */
#define RCU_FLAG_WWDGT0                       RCU_SUBSERSTAT_WWDGT0_RSTF                          /*!< Subsystem reset flag WWDGT0_RSTF */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define RCU_FLAG_WWDGT1                       RCU_SUBSERSTAT_WWDGT1_RSTF                          /*!< Subsystem reset flag WWDGT1_RSTF */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define RCU_FLAG_HSM_WDGT                     RCU_SUBSERSTAT_HSM_WDGT_RSTF                        /*!< Subsystem reset flag HSM_WDGT_RSTF */
#define RCU_FLAG_HSM_APP                      RCU_SUBSERSTAT_HSM_APP_RSTF                         /*!< Subsystem reset flag HSM_APP_RSTF */
#define RCU_FLAG_SW_SUBS                      RCU_SUBSERSTAT_SW_SUBS_RSTF                         /*!< Subsystem reset flag SW_SUBS_RSTF */
#define RCU_FLAG_DBG                          RCU_SUBSERSTAT_DBG_RSTF                             /*!< Debug reset flag DBG_RSTF */
#define RCU_FLAG_OBL                          RCU_SUBSERSTAT_OBL_RSTF                             /*!< Option byte loader reset flag */


/* RCTL TMR flag definitions */
#define RCU_FLAG_RCU_SYSRSTSTAT               RCU_TMRERRSTAT_TMR_RCU_SYSRSTSTAT                   /*!< RCU_SYSRSTSTAT TMR error status */
#define RCU_FLAG_RCU_SUBSRCTL                 RCU_TMRERRSTAT_TMR_RCU_SUBSRCTL                     /*!< RCU_SUBSRCTL TMR error status */
#define RCU_FLAG_RCU_SUBSRPACTL               RCU_TMRERRSTAT_TMR_RCU_SUBSRPACTL                   /*!< RCU_SUBSRPACTL TMR error status */
#define RCU_FLAG_RCU_SYSMRETH                 RCU_TMRERRSTAT_TMR_RCU_SYSMRETH                     /*!< RCU_SYSMRETH TMR error status */
#define RCU_FLAG_RCU_ERPACFG                  RCU_TMRERRSTAT_TMR_RCU_ERPACFG                      /*!< RCU_ERPACFG TMR error status */
#define RCU_FLAG_AHBRST                       RCU_TMRERRSTAT_TMR_AHBRST                           /*!< AHBRST TMR error status */
#define RCU_FLAG_APBRST                       RCU_TMRERRSTAT_TMR_APBRST                           /*!< APBRST1/2 TMR error status */
#define RCU_FLAG_PORWDG1                      RCU_TMRERRSTAT_TMR_PORWDG1                          /*!< PORWDG1 TMR error status */
#define RCU_FLAG_PORWDG2                      RCU_TMRERRSTAT_TMR_PORWDG2                          /*!< PORWDG2 TMR error status*/
#define RCU_FLAG_PORWDG3                      RCU_TMRERRSTAT_TMR_PORWDG3                          /*!< PORWDG3 TMR error status */
#define RCU_FLAG_PORWDG4                      RCU_TMRERRSTAT_TMR_PORWDG4                          /*!< PORWDG4 TMR error status */

/* RCTL standby reset flag definitions */
#define RCU_FLAG_SYSRST                       RCU_RDSMSTAT_SYSRESF                                /*!< System reset event occurred flag in standby mode */
#define RCU_FLAG_SUBSRST                      RCU_RDSMSTAT_SUBSRESF                               /*!< Subsystem reset event occurred flag in standby mode */
/* RCTL Low-Power debug flag definitions */
#define RCU_FLAG_LPDBG                        RCU_LPDBGSTAT_LPDBGF                                /*!< Low-Power debug flag */

