sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* CCTL flag definitions */
/* clock stabilization and peripheral reset flags */
typedef enum {
    /* clock stabilization flags */
    RCU_FLAG_HXTALSTB      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 17U),            /*!< HXTAL stabilization flag */
    RCU_FLAG_PLLSTB        = RCU_REGIDX_BIT(CTL_REG_OFFSET, 25U),            /*!< PLL stabilization flag */
    RCU_FLAG_LXTALSTB      = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 1U),           /*!< LXTAL stabilization flag */
} rcu_flag_enum;

/* clock stabilization and ckm interrupt flags */
typedef enum {
    RCU_INT_FLAG_LXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 1U),             /*!< LXTAL stabilization interrupt flag */
    RCU_INT_FLAG_HXTALSTB  = RCU_REGIDX_BIT(INT_REG_OFFSET, 3U),             /*!< HXTAL stabilization interrupt flag */
    RCU_INT_FLAG_PLLSTB    = RCU_REGIDX_BIT(INT_REG_OFFSET, 4U),             /*!< PLL stabilization interrupt flag */
    RCU_INT_FLAG_CKM       = RCU_REGIDX_BIT(INT_REG_OFFSET, 7U),             /*!< HXTAL clock stuck interrupt flag */
} rcu_int_flag_enum;

/* clock frequency monitor interrupt flags */
#define RCU_FLAG_FLMIN     RCU_CKFMCTL_FLMIN                                 /*!< Frequency lower than low frequency reference threshold event status */
#define RCU_FLAG_FHMAX     RCU_CKFMCTL_FHMAX                                 /*!< Frequency higher than high frequency reference threshold event status */

/* clock stabilization and stuck interrupt flags clear */
typedef enum {
    RCU_INT_FLAG_LXTALSTB_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 17U),        /*!< LXTAL stabilization interrupt flag clear */
    RCU_INT_FLAG_HXTALSTB_CLR  = RCU_REGIDX_BIT(INT_REG_OFFSET, 19U),        /*!< HXTAL stabilization interrupt flag clear */
    RCU_INT_FLAG_PLLSTB_CLR    = RCU_REGIDX_BIT(INT_REG_OFFSET, 20U),        /*!< PLL stabilization interrupt flag clear */
    RCU_INT_FLAG_CKM_CLR       = RCU_REGIDX_BIT(INT_REG_OFFSET, 23U),        /*!< CKM interrupt flag clear */
} rcu_int_flag_clear_enum;

/* CCTL TMR flag definitions */
#define RCU_FLAG_ST0                          RCU_BUSIM_TMR_TMR_ST0                               /*!< System clock switching TMR error status */
#define RCU_FLAG_ST1                          RCU_BUSIM_TMR_TMR_ST1                               /*!< Clock enable TMR error status */
#define RCU_FLAG_ST2                          RCU_BUSIM_TMR_TMR_ST2                               /*!< Clock monitor enable register TMR error status */
#define RCU_FLAG_ST3                          RCU_BUSIM_TMR_TMR_ST3                               /*!< The TMR error occurs in any bit of TRIM register */
/* CCTL loss of lock detector flag definition */
#define RCU_FLAG_PLLLOL                       RCU_PLLLOL_PLLLOLF                                  /*!< Clear PLLLOLF flag */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

/* check system clock source */
#define NOT_RCU_CKSYSSRC(ck_sys)                               (((ck_sys) != RCU_CKSYSSRC_IRC48M) && ((ck_sys) != RCU_CKSYSSRC_HXTAL) && \
                                                               ((ck_sys) != RCU_CKSYSSRC_PLL))
/* check AHB clock prescaler parameter */
#define NOT_RCU_AHB_PSC(ck_ahb)                                (((ck_ahb) != RCU_AHB_CKSYS_DIV1)   && ((ck_ahb) != RCU_AHB_CKSYS_DIV2) && \
                                                               ((ck_ahb) != RCU_AHB_CKSYS_DIV4)   && ((ck_ahb) != RCU_AHB_CKSYS_DIV8) && \
                                                               ((ck_ahb) != RCU_AHB_CKSYS_DIV16)  && ((ck_ahb) != RCU_AHB_CKSYS_DIV64) && \
                                                               ((ck_ahb) != RCU_AHB_CKSYS_DIV128) && ((ck_ahb) != RCU_AHB_CKSYS_DIV256) && \
                                                               ((ck_ahb) != RCU_AHB_CKSYS_DIV512))
/* check APB1 clock prescaler parameter */
#define NOT_RCU_APB1_PSC(ck_apb1)                              (((ck_apb1) != RCU_APB1_CKAHB_DIV1)  && ((ck_apb1) != RCU_APB1_CKAHB_DIV2) && \
                                                               ((ck_apb1) != RCU_APB1_CKAHB_DIV4)  && ((ck_apb1) != RCU_APB1_CKAHB_DIV8) && \
                                                               ((ck_apb1) != RCU_APB1_CKAHB_DIV16))
/* check APB2 clock prescaler parameter */
#define NOT_RCU_APB2_PSC(ck_apb2)                              (((ck_apb2) != RCU_APB2_CKAHB_DIV1)  && ((ck_apb2) != RCU_APB2_CKAHB_DIV2) && \
                                                               ((ck_apb2) != RCU_APB2_CKAHB_DIV4)  && ((ck_apb2) != RCU_APB2_CKAHB_DIV8) && \
                                                               ((ck_apb2) != RCU_APB2_CKAHB_DIV16))

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* check CK_OUT0 clock source */
#define NOT_RCU_CKOUT0SRC(ckout_src)                           (((ckout_src) != RCU_CKOUT0SRC_CORECK)       && ((ckout_src) != RCU_CKOUT0SRC_CKAPB1) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_IRC40K)       && ((ckout_src) != RCU_CKOUT0SRC_LXTAL) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_CKSYS)        && ((ckout_src) != RCU_CKOUT0SRC_IRC48M) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_HXTAL)        && ((ckout_src) != RCU_CKOUT0SRC_CKPLLP) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_CKPLLP_DIV2)  && ((ckout_src) != RCU_CKOUT0SRC_CKAPB2) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_HSMPCLK)      && ((ckout_src) != RCU_CKOUT0SRC_HSMHCLK) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_CKENETRX)     && ((ckout_src) != RCU_CKOUT0SRC_CKENETTX) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_CKENETMACRMI) && ((ckout_src) != RCU_CKOUT0SRC_CKENETTS))
/* check CK_OUT0 clock prescaler parameter */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#if defined (GD32A711X_A712X)
/* check CK_OUT0 clock source */
#define NOT_RCU_CKOUT0SRC(ckout_src)                           (((ckout_src) != RCU_CKOUT0SRC_CORECK)       && ((ckout_src) != RCU_CKOUT0SRC_CKAPB1) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_IRC40K)       && ((ckout_src) != RCU_CKOUT0SRC_LXTAL) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_CKSYS)        && ((ckout_src) != RCU_CKOUT0SRC_IRC48M) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_HXTAL)        && ((ckout_src) != RCU_CKOUT0SRC_CKPLLP) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_CKPLLP_DIV2)  && ((ckout_src) != RCU_CKOUT0SRC_CKAPB2) && \
                                                               ((ckout_src) != RCU_CKOUT0SRC_HSMPCLK)      && ((ckout_src) != RCU_CKOUT0SRC_HSMHCLK))
#endif /*defined(GD32A711X_A712X)*/

#define NOT_RCU_CKOUT0_DIV(ckout_div)                          (((ckout_div) != RCU_CKOUT0_DIV1)   && ((ckout_div) != RCU_CKOUT0_DIV2) && \
                                                               ((ckout_div) != RCU_CKOUT0_DIV4)   && ((ckout_div) != RCU_CKOUT0_DIV8) && \
                                                               ((ckout_div) != RCU_CKOUT0_DIV16)  && ((ckout_div) != RCU_CKOUT0_DIV32) && \
                                                               ((ckout_div) != RCU_CKOUT0_DIV64)  && ((ckout_div) != RCU_CKOUT0_DIV128))
/* check CK_OUT1 clock source */
#define NOT_RCU_CKOUT1SRC(ckout1_src)                          (((ckout1_src) != RCU_CKOUT1SRC_IRC40K) && ((ckout1_src) != RCU_CKOUT1SRC_LXTAL) && \
                                                               ((ckout1_src) != RCU_CKOUT1SRC_CKAPB2) && ((ckout1_src) != RCU_CKOUT1SRC_IRC48M) && \
                                                               ((ckout1_src) != RCU_CKOUT1SRC_HXTAL))
/* check CK_OUT1 clock prescaler parameter */
#define NOT_RCU_CKOUT1_DIV(ckout1_div)                         (((ckout1_div) != RCU_CKOUT1_DIV1)   && ((ckout1_div) != RCU_CKOUT1_DIV2) && \
                                                               ((ckout1_div) != RCU_CKOUT1_DIV4)   && ((ckout1_div) != RCU_CKOUT1_DIV8) && \
                                                               ((ckout1_div) != RCU_CKOUT1_DIV16)  && ((ckout1_div) != RCU_CKOUT1_DIV32) && \
                                                               ((ckout1_div) != RCU_CKOUT1_DIV64)  && ((ckout1_div) != RCU_CKOUT1_DIV128))
/* check the main PLL clock parameter */
#define NOT_RCU_PLLSRC(pll_src)                                (((pll_src) != RCU_PLLSRC_IRC48M) && ((pll_src) != RCU_PLLSRC_HXTAL))
/* check the main PLL prescaler range */
#define RCU_PLL_PREDV_MIN                                      1U
#define RCU_PLL_PREDV_MAX                                      7U
#define NOT_RCU_PLL_PREDV_RANGE(pll_predv)                     (((pll_predv) < RCU_PLL_PREDV_MIN) || ((pll_predv) > RCU_PLL_PREDV_MAX))
/* check the PLL VCO clock multi factor range */
#define RCU_PLL_N_MIN                                          16U
#define RCU_PLL_N_MAX                                          255U
#define NOT_RCU_PLL_N_RANGE(pll_n)                             (((pll_n) < RCU_PLL_N_MIN) || ((pll_n) > RCU_PLL_N_MAX))
/* check the PLL output frequency division factor range */
#define RCU_PLLDIV_MIN                                         1U
#define RCU_PLLDIV_MAX                                         64U
#define NOT_RCU_PLLDIV_RANGE(pll_plldiv)                      (((pll_plldiv) < RCU_PLLDIV_MIN) || ((pll_plldiv) > RCU_PLLDIV_MAX))
/* check ADC clock source */
#define NOT_RCU_ADCSRC(adc_src)                               (((adc_src) != RCU_ADCSRC_HCLK) && ((adc_src) != RCU_ADCSRC_SYS) && \
                                                              ((adc_src) != RCU_ADCSRC_PLLP))
/* check ADC prescaler factor */
#define NOT_RCU_CKADC_CKAHB_PSC(adc_psc)                      (((adc_psc) != RCU_CKADC_DIV2)  && ((adc_psc) != RCU_CKADC_DIV3) && \
                                                              ((adc_psc) != RCU_CKADC_DIV4)  && ((adc_psc) != RCU_CKADC_DIV5) && \
                                                              ((adc_psc) != RCU_CKADC_DIV6)  && ((adc_psc) != RCU_CKADC_DIV7) && \
                                                              ((adc_psc) != RCU_CKADC_DIV8)  && ((adc_psc) != RCU_CKADC_DIV9) && \
                                                              ((adc_psc) != RCU_CKADC_DIV10) && ((adc_psc) != RCU_CKADC_DIV11) && \
                                                              ((adc_psc) != RCU_CKADC_DIV12) && ((adc_psc) != RCU_CKADC_DIV13) && \
                                                              ((adc_psc) != RCU_CKADC_DIV14) && ((adc_psc) != RCU_CKADC_DIV15) && \
                                                              ((adc_psc) != RCU_CKADC_DIV16) && ((adc_psc) != RCU_CKADC_DIV17) && \
                                                              ((adc_psc) != RCU_CKADC_DIV18) && ((adc_psc) != RCU_CKADC_DIV19) && \
                                                              ((adc_psc) != RCU_CKADC_DIV20) && ((adc_psc) != RCU_CKADC_DIV21) && \
                                                              ((adc_psc) != RCU_CKADC_DIV22) && ((adc_psc) != RCU_CKADC_DIV23) && \
                                                              ((adc_psc) != RCU_CKADC_DIV24) && ((adc_psc) != RCU_CKADC_DIV25) && \
                                                              ((adc_psc) != RCU_CKADC_DIV26) && ((adc_psc) != RCU_CKADC_DIV27) && \
                                                              ((adc_psc) != RCU_CKADC_DIV28) && ((adc_psc) != RCU_CKADC_DIV29) && \
                                                              ((adc_psc) != RCU_CKADC_DIV30) && ((adc_psc) != RCU_CKADC_DIV31) && \
                                                              ((adc_psc) != RCU_CKADC_DIV32))
/* check the SPI clock source */
/* check SPI clock source */
/* check SPI clock source */
#define NOT_RCU_SPISRC(spi_src)                              (((spi_src) != RCU_SPISRC_APB1)                  && \
                                                             ((spi_src) != RCU_SPISRC_APB2)                  && \
                                                             ((spi_src) != RCU_SPISRC_IRC48M)                && \
                                                             ((spi_src) != RCU_SPISRC_AHB))
/* check the SPI clock divider range */
#define RCU_SPI_DIV_MIN                                      1U
#define RCU_SPI_DIV_MAX                                      64U
#define NOT_RCU_CKSPIDIV(spi_div)                            (((spi_div) < RCU_SPI_DIV_MIN) || ((spi_div) > RCU_SPI_DIV_MAX))
/* check RTC clock source */
#define NOT_RCU_RTCSRC(rtc_clock_source)                      (((rtc_clock_source) != RCU_RTCSRC_NONE)          && ((rtc_clock_source) != RCU_RTCSRC_LXTAL) && \
                                                              ((rtc_clock_source) != RCU_RTCSRC_IRC40K)        && ((rtc_clock_source) != RCU_RTCSRC_HXTAL_DIV_128))
/* check USART periph */
#define NOT_RCU_USART_PERIPH(usart_clock_source)              (((usart_clock_source) != USART0) && ((usart_clock_source) != USART1) && \
                                                              ((usart_clock_source) != USART2) && ((usart_clock_source) != USART3) && \
                                                              ((usart_clock_source) != USART4) && ((usart_clock_source) != USART5))
/* check USART clock source */
#define NOT_RCU_USARTSRC(usart_clock_source)                  (((usart_clock_source) != RCU_USARTSRC_IRC48M)  && ((usart_clock_source) != RCU_USARTSRC_LXTAL) && \
                                                              ((usart_clock_source) != RCU_USARTSRC_HCLK)    && ((usart_clock_source) != RCU_USARTSRC_PCLK1_2))

/* check DTM_CAN periph */
#define NOT_RCU_DTM_CAN_PERIPH(dtm_can_periph)                (((dtm_can_periph) != (uint32_t)DTM_CAN0) && ((dtm_can_periph) != (uint32_t)DTM_CAN1) && \
                                                              ((dtm_can_periph) != (uint32_t)DTM_CAN2) && ((dtm_can_periph) != (uint32_t)DTM_CAN3) && \
                                                              ((dtm_can_periph) != (uint32_t)DTM_CAN4) && ((dtm_can_periph) != (uint32_t)DTM_CAN5) && \
                                                              ((dtm_can_periph) != (uint32_t)DTM_CAN6) && ((dtm_can_periph) != (uint32_t)DTM_CAN7))

/* check the DTM_CAN clock source */
#define NOT_RCU_DTM_CANSRC(dtm_can_clock_source)                      (((dtm_can_clock_source) != RCU_DTM_CANSRC_HXTAL)       && ((dtm_can_clock_source) != RCU_DTM_CANSRC_AHB) && \
                                                              ((dtm_can_clock_source) != RCU_DTM_CANSRC_PCLK2 ) && ((dtm_can_clock_source) != RCU_DTM_CANSRC_IRC48M))

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* check WWDGT periph */
#define NOT_RCU_WWDGT_PERIPH(wwdgt_periph)                    (((wwdgt_periph) != WWDGT0) && ((wwdgt_periph) != WWDGT1))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#if defined (GD32A711X_A712X)
/* check WWDGT periph */
#define NOT_RCU_WWDGT_PERIPH(wwdgt_periph)                    (((wwdgt_periph) != WWDGT0))
#endif /*defined(GD32A711X_A712X)*/

/* check the WWDGT clock source */
#define NOT_RCU_WWDGTSRC(wwdgt_clock_source)                  (((wwdgt_clock_source) != RCU_WWDGTSRC_IRC48M) && ((wwdgt_clock_source) != RCU_WWDGTSRC_LXTAL) && \
                                                              ((wwdgt_clock_source) != RCU_WWDGTSRC_IRC40K) && ((wwdgt_clock_source) != RCU_WWDGTSRC_HXTAL) && \
                                                              ((wwdgt_clock_source) != RCU_WWDGTSRC_CKSYS)  && ((wwdgt_clock_source) != RCU_WWDGTSRC_PCLK1))

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* check FWDGT periph */
#define NOT_RCU_FWDGT_PERIPH(fwdgt_periph)                    (((fwdgt_periph) != FWDGT0) && ((fwdgt_periph) != FWDGT1))
/* check the FWDGT clock source */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#if defined (GD32A711X_A712X)
/* check FWDGT periph */
#define NOT_RCU_FWDGT_PERIPH(fwdgt_periph)                    (((fwdgt_periph) != FWDGT0))
/* check the FWDGT clock source */
#endif /*defined(GD32A711X_A712X)*/

#define NOT_RCU_FWDGTSRC(fwdgt_clock_source)                  (((fwdgt_clock_source) != RCU_FWDGTSRC_IRC40K) && ((fwdgt_clock_source) != RCU_FWDGTSRC_LXTAL))
/* check the LIN clock source */
/* check LINFlexD clock source */
#define NOT_RCU_LINFLEXDSRC(linflexd_clock_source)           (((linflexd_clock_source) != RCU_LINFLEXDSRC_CKSYS)    && \
                                                             ((linflexd_clock_source) != RCU_LINFLEXDSRC_PLL_P)    && \
                                                             ((linflexd_clock_source) != RCU_LINFLEXDSRC_HXTAL)    && \
                                                             ((linflexd_clock_source) != RCU_LINFLEXDSRC_IRC48M))
/* check the MFCOM clock prescaler */
#define NOT_RCU_CKMFCOM_CKAHB_DIV(mfcom_psc)                  (((mfcom_psc) != RCU_CKMFCOM_CKAHB_DIV1) && ((mfcom_psc) != RCU_CKMFCOM_CKAHB_DIV2) && \
                                                              ((mfcom_psc) != RCU_CKMFCOM_CKAHB_DIV4) && ((mfcom_psc) != RCU_CKMFCOM_CKAHB_DIV8))
/* check AIT clock source */
#define NOT_RCU_CKAITSRC(ait_clock_source)                    (((ait_clock_source) != RCU_CKAITSRC_IRC48M)      && ((ait_clock_source) != RCU_CKAITSRC_CK_PLL_Q_DIV2) && \
                                                              ((ait_clock_source) != RCU_CKAITSRC_CK_PLL_Q_DIV3) && ((ait_clock_source) != RCU_CKAITSRC_CK_PLL_Q_DIV4))
/* check ATE clock source */
#define NOT_RCU_CKATESRC(ate_clock_source)                    (((ate_clock_source) != RCU_CKATESRC_IRC48M)      && ((ate_clock_source) != RCU_CKATESRC_CK_PLL_Q_DIV2) && \
                                                              ((ate_clock_source) != RCU_CKATESRC_CK_PLL_Q_DIV3) && ((ate_clock_source) != RCU_CKATESRC_CK_PLL_Q_DIV4))
/* check TRACE clock source */
#define NOT_RCU_TRACESRC(trace_clock_source)                  (((trace_clock_source) != RCU_TRACESRC_PLLQ)   && ((trace_clock_source) != RCU_TRACESRC_PLLP) && \
                                                              ((trace_clock_source) != RCU_TRACESRC_HXTAL)   && ((trace_clock_source) != RCU_TRACESRC_IRC48M))
/* check the TRACE clock prescaler */
#define NOT_RCU_CKTRACE_DIV(trace_clock_psc)                  (((trace_clock_psc) != RCU_CKTRACE_DIV1) && ((trace_clock_psc) != RCU_CKTRACE_DIV2) && \
                                                              ((trace_clock_psc) != RCU_CKTRACE_DIV3) && ((trace_clock_psc) != RCU_CKTRACE_DIV4) && \
                                                              ((trace_clock_psc) != RCU_CKTRACE_DIV5) && ((trace_clock_psc) != RCU_CKTRACE_DIV6) && \
                                                              ((trace_clock_psc) != RCU_CKTRACE_DIV7) && ((trace_clock_psc) != RCU_CKTRACE_DIV8))
/* check QSPI clock source */
#define NOT_RCU_QSPISRC(qspi_clock_source)                    (((qspi_clock_source) != RCU_QSPISRC_PLLQ)   && ((qspi_clock_source) != RCU_QSPISRC_PLLP) && \
                                                              ((qspi_clock_source) != RCU_QSPISRC_HCLK)   && ((qspi_clock_source) != RCU_QSPISRC_IRC48M))
/* check ENET clock source */
#define NOT_RCU_ENETTSSRC(enet_clock_source)                  (((enet_clock_source) != RCU_ENETTSSRC_CK_ENETTX) && ((enet_clock_source) != RCU_ENETTSSRC_CK_ENETRX) && \
                                                              ((enet_clock_source) != RCU_ENETTSSRC_PLLP)      && ((enet_clock_source) != RCU_ENETTSSRC_HXTAL) && \
                                                              ((enet_clock_source) != RCU_ENETTSSRC_IRC48M))
/* check the LXTAL drive capability */
#define NOT_RCU_LXTAL_DRIVE(lxtal_dricap)                     (((lxtal_dricap) != RCU_LXTAL_LOWDRI)      && ((lxtal_dricap) != RCU_LXTAL_MED_LOWDRI) && \
                                                              ((lxtal_dricap) != RCU_LXTAL_MED_HIGHDRI) && ((lxtal_dricap) != RCU_LXTAL_HIGHDRI))
/* check HXTAL frequency scale */
#define NOT_HXTAL_SCALE(hxtal_scal)                           (((hxtal_scal) != HXTAL_SCALE_4M_TO_8M)   && ((hxtal_scal) != HXTAL_SCALE_8M_TO_16M) && \
                                                              ((hxtal_scal) != HXTAL_SCALE_16M_TO_32M) && ((hxtal_scal) != HXTAL_SCALE_32M_TO_40M))
/* check input of PLL clock perescaler */
#define NOT_RCU_PREDV_DIV(prediv)                             (((prediv) != RCU_PREDV_DIV1) && ((prediv) != RCU_PREDV_DIV2) && \
                                                              ((prediv) != RCU_PREDV_DIV3) && ((prediv) != RCU_PREDV_DIV4) && \
                                                              ((prediv) != RCU_PREDV_DIV5) && ((prediv) != RCU_PREDV_DIV6) && \
                                                              ((prediv) != RCU_PREDV_DIV7))
/* check the IRC48M adjust value */
#define RCU_IRC48M_ADJVAL_MAX                                 0x1FU
#define NOT_RCU_IRC48M_ADJVAL_RANGE(irc48m_adjval)            ((irc48m_adjval) > RCU_IRC48M_ADJVAL_MAX)

/* check the CKFM peripheral (interrupt)*/
#define NOT_RCU_CKFM_PERIPH(ckfmx)                           (((ckfmx) != CKFM0) && ((ckfmx) != CKFM1) && ((ckfmx) != CKFM2) && ((ckfmx) != CKFM3) && ((ckfmx) != CKFM4))

/* check the frequency monitor interrupt */
#define NOT_RCU_CKFMCTL_INT(interrupt)                        (((interrupt) != RCU_CKFMCTL_FLMINRE) && ((interrupt) != RCU_CKFMCTL_FHMAXRE))

/* check the CKFM peripheral (reset) */
#define NOT_RCU_CKFM_RST_PERIPH(ckfmx)                        (((ckfmx) != CKFM1) && ((ckfmx) != CKFM2))

/* check the CKFM peripheral (interrupt)*/
#define NOT_RCU_CKFM_INT_PERIPH(ckfmx)                        (((ckfmx) != CKFM0) && ((ckfmx) != CKFM3) && ((ckfmx) != CKFM4))

