sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* check the frequency monitor(0,3,4) interrupt */
#define NOT_RCU_CKFMCTL_INI(interrupt)                        (((interrupt) != RCU_CKFMCTL_FLMINIE) && ((interrupt) != RCU_CKFMCTL_FHMAXIE))

/* check the frequency monitor0 reset */
#define NOT_RCU_CKFMCTL_RST(reset)                            (((reset) != RCU_CKFMCTL_FHMAXRE) && ((reset) != RCU_CKFMCTL_FLMINRE))

/* check the frequency monitor(1,2) reset */
#define NOT_RCU_CKFMCTL_RST_1(reset)                          (((reset) != RCU_CKFMCTL_FLMINIE) && ((reset) != RCU_CKFMCTL_FHMAXIE))

/* check the clock frequency which to get*/
#define NOT_RCU_CK_FREQ(interrupt)                            (((interrupt) != CK_SYS)    && ((interrupt) != CK_AHB) && \
                                                              ((interrupt) != CK_APB1)   && ((interrupt) != CK_APB2) && \
                                                              ((interrupt) != CK_LINFLEXD))
/* check the system reset flag*/
#define NOT_RCU_SYS_RESET_FLAG(sysrst_flag)                   (((sysrst_flag) != RCU_FLAG_POR)           && ((sysrst_flag) != RCU_FLAG_FMU_REA_FAIL) && \
                                                              ((sysrst_flag) != RCU_FLAG_STCM_REC_FAIL) && ((sysrst_flag) != RCU_FLAG_RCTL_SUBSRU) && \
                                                              ((sysrst_flag) != RCU_FLAG_LOHRST)        && ((sysrst_flag) != RCU_FLAG_LOPRST) && \
                                                              ((sysrst_flag) != RCU_FLAG_CORE_CK_FAIL)  && ((sysrst_flag) != RCU_FLAG_SYS_CK_FAIL) && \
                                                              ((sysrst_flag) != RCU_FLAG_HSM_SYSRST)    && ((sysrst_flag) != RCU_FLAG_SW_SYSRST) && \
                                                              ((sysrst_flag) != RCU_FLAG_DBG_SYSRST))

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* check the subsystem reset flag*/
#define NOT_RCU_SUBSYS_RESET_FLAG(subsysrst_flag)             (((subsysrst_flag) != RCU_FLAG_EXTRST)   && \
                                                              ((subsysrst_flag) != RCU_FLAG_OBSTDBY)   && ((subsysrst_flag) != RCU_FLAG_FMU) && \
                                                              ((subsysrst_flag) != RCU_FLAG_ST_FINISH) && ((subsysrst_flag) != RCU_FLAG_FWDGT0) && \
                                                              ((subsysrst_flag) != RCU_FLAG_FWDGT1)    && ((subsysrst_flag) != RCU_FLAG_SWRST) && \
                                                              ((subsysrst_flag) != RCU_FLAG_WWDGT0)    && ((subsysrst_flag) != RCU_FLAG_WWDGT1) && \
                                                              ((subsysrst_flag) != RCU_FLAG_HSM_WDGT)  && ((subsysrst_flag) != RCU_FLAG_HSM_APP) && \
                                                              ((subsysrst_flag) != RCU_FLAG_SW_SUBS)   && ((subsysrst_flag) != RCU_FLAG_DBG) && \
                                                              ((subsysrst_flag) != RCU_FLAG_OBL))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#if defined (GD32A711X_A712X)
/* check the subsystem reset flag*/
#define NOT_RCU_SUBSYS_RESET_FLAG(subsysrst_flag)             (((subsysrst_flag) != RCU_FLAG_EXTRST)   && \
                                                              ((subsysrst_flag) != RCU_FLAG_OBSTDBY)   && ((subsysrst_flag) != RCU_FLAG_FMU) && \
                                                              ((subsysrst_flag) != RCU_FLAG_ST_FINISH) && ((subsysrst_flag) != RCU_FLAG_FWDGT0) && \
                                                              ((subsysrst_flag) != RCU_FLAG_WWDGT0)    && ((subsysrst_flag) != RCU_FLAG_SWRST) && \
                                                              ((subsysrst_flag) != RCU_FLAG_HSM_WDGT)  && ((subsysrst_flag) != RCU_FLAG_HSM_APP) && \
                                                              ((subsysrst_flag) != RCU_FLAG_SW_SUBS)   && ((subsysrst_flag) != RCU_FLAG_DBG) && \
                                                              ((subsysrst_flag) != RCU_FLAG_OBL))
#endif /*defined(GD32A711X_A712X)*/

/* check RCTL triple modular redundancy error output*/
#define NOT_RCU_TMRERRSTAT_TMR_EN(rctl_tmr)                   (((rctl_tmr) != RCU_TMRERRSTAT_TMR_RCU_SYSRSTSTATEN) && ((rctl_tmr) != RCU_TMRERRSTAT_TMR_RCU_SUBSRCTLEN) && \
                                                              ((rctl_tmr) != RCU_TMRERRSTAT_TMR_RCU_SUBSRPACTLEN) && ((rctl_tmr) != RCU_TMRERRSTAT_TMR_RCU_SYSMRETHEN) && \
                                                              ((rctl_tmr) != RCU_TMRERRSTAT_TMR_RCU_ERPACFGEN)    && ((rctl_tmr) != RCU_TMRERRSTAT_TMR_AHBRSTEN) && \
                                                              ((rctl_tmr) != RCU_TMRERRSTAT_TMR_APBRSTEN)         && ((rctl_tmr) != RCU_TMRERRSTAT_TMR_PORWDG1EN) && \
                                                              ((rctl_tmr) != RCU_TMRERRSTAT_TMR_PORWDG2EN)        && ((rctl_tmr) != RCU_TMRERRSTAT_TMR_PORWDG3EN) && \
                                                              ((rctl_tmr) != RCU_TMRERRSTAT_TMR_PORWDG4EN))
/* check CCTL triple modular redundancy error output*/
#define NOT_RCU_BUSIM_TMR_TMR_EN(cctl_tmr)                    (((cctl_tmr) != RCU_BUSIM_TMR_TMR_EN0) && ((cctl_tmr) != RCU_BUSIM_TMR_TMR_EN1) && \
                                                              ((cctl_tmr) != RCU_BUSIM_TMR_TMR_EN2) && ((cctl_tmr) != RCU_BUSIM_TMR_TMR_EN3))
/* check RCTL TMR flags*/
#define NOT_RCU_RCTL_TMR_FLAG(rctl_tmr_flag)                  (((rctl_tmr_flag) != RCU_FLAG_RCU_SYSRSTSTAT) && ((rctl_tmr_flag) != RCU_FLAG_RCU_SUBSRCTL) && \
                                                              ((rctl_tmr_flag) != RCU_FLAG_RCU_SUBSRPACTL) && ((rctl_tmr_flag) != RCU_FLAG_RCU_SYSMRETH) && \
                                                              ((rctl_tmr_flag) != RCU_FLAG_RCU_ERPACFG)    && ((rctl_tmr_flag) != RCU_FLAG_AHBRST) && \
                                                              ((rctl_tmr_flag) != RCU_FLAG_APBRST)         && ((rctl_tmr_flag) != RCU_FLAG_PORWDG1) && \
                                                              ((rctl_tmr_flag) != RCU_FLAG_PORWDG2)        && ((rctl_tmr_flag) != RCU_FLAG_PORWDG3) && \
                                                              ((rctl_tmr_flag) != RCU_FLAG_PORWDG4))

