sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/* check CCTL TMR flags*/
#define NOT_RCU_CCTL_TMR_FLAG(cctl_tmr_flag)                  (((cctl_tmr_flag) != RCU_FLAG_ST0) && ((cctl_tmr_flag) != RCU_FLAG_ST1) && \
                                                              ((cctl_tmr_flag) != RCU_FLAG_ST2) && ((cctl_tmr_flag) != RCU_FLAG_ST3))
/* check PLL loss of lock accuracy*/
#define NOT_RCU_PLLLOL_UNLOCK_RANGE(lol_accuracy)             (((lol_accuracy) != RCU_PLLLOL_UNLOCK_RANGE_1) && ((lol_accuracy) != RCU_PLLLOL_UNLOCK_RANGE_2) && \
                                                              ((lol_accuracy) != RCU_PLLLOL_UNLOCK_RANGE_3) && ((lol_accuracy) != RCU_PLLLOL_UNLOCK_RANGE_4))
/* check PLL spread spectrum modulation type*/
#define NOT_RCU_SS_TYPE(spread_spectrum_type)                 (((spread_spectrum_type) != RCU_SS_TYPE_CENTER) && ((spread_spectrum_type) != RCU_SS_TYPE_DOWN))
/* check standby reset flag*/
#define NOT_RCU_STANDBY_RESET_FLAG(flag)                      (((flag) != RCU_FLAG_SYSRST)  && ((flag) != RCU_FLAG_SUBSRST))

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* check subsystem reset pin assertion*/
#define NOT_RCU_SUBSRPACTL_RPAEN(subsysrsrt)                  ((subsysrsrt) != RCU_SUBSRPACTL_ST_FINISH_RPAEN)
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#if defined (GD32A711X_A712X)
/* check subsystem reset pin assertion*/
#define NOT_RCU_SUBSRPACTL_RPAEN(subsysrsrt)                  ((subsysrsrt) != RCU_SUBSRPACTL_ST_FINISH_RPAEN)
#endif /*defined(GD32A711X_A712X)*/

/* check control status */
#define NOT_CTL_STATUS(reset_pin_assert)                      (((reset_pin_assert) != ENABLE)  && ((reset_pin_assert) != DISABLE))

#endif /* FW_DEBUG_ERR_REPORT */


/* function declarations */
/* peripherals clock configure functions */
/* deinitialize the RCU */
void rcu_deinit(void);
/* enable the peripherals clock */
void rcu_periph_clock_enable(rcu_periph_enum periph);
/* disable the peripherals clock */
void rcu_periph_clock_disable(rcu_periph_enum periph);
/* reset the peripherals */
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset);
/* disable reset the peripheral */
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset);

/* system and peripherals clock source, system reset configure functions */
/* configure the system clock source */
void rcu_system_clock_source_config(uint32_t ck_sys);
/* get the system clock source */
uint32_t rcu_system_clock_source_get(void);
/* configure the AHB prescaler selection */
void rcu_ahb_clock_config(uint32_t ck_ahb);
/* configure the APB1 prescaler selection */
void rcu_apb1_clock_config(uint32_t ck_apb1);
/* configure the APB2 prescaler selection */
void rcu_apb2_clock_config(uint32_t ck_apb2);
/* configure the CK_OUT0 clock source and divider */
void rcu_ckout0_config(uint32_t ckout_src, uint32_t ckout_div);
/* configure the CK_OUT1 clock source and divider */
void rcu_ckout1_config(uint32_t ckout1_src, uint32_t ckout_div);
/* configure the PLL clock source selection and PLL multiply factor */
void rcu_pll_config(uint32_t pll_src, uint32_t pll_predv, uint32_t pll_n, uint32_t pll_pllpdiv, uint32_t pll_pllqdiv);
/* configure the ADC division factor and ADC clock source */
void rcu_adc_clock_config(uint32_t adc_src, uint32_t adc_psc);
/* configure the SPI division factor and SPI clock source */
void rcu_spi_clock_config(uint32_t spi_src, uint32_t spi_div);
/* configure the RTC clock source selection */
void rcu_rtc_clock_config(uint32_t rtc_clock_source);
/* configure the DTM_CAN clock source selection */
void rcu_dtm_can_clock_config(uint32_t dtm_can_periph, uint32_t dtm_can_clock_source);
/* configure the WWDGT clock source selection */
void rcu_wwdgt_clock_config(uint32_t wwdgt_periph, uint32_t wwdgt_clock_source);
/* configure the FWDGT clock source selection */
void rcu_fwdgt_clock_config(uint32_t fwdgt_periph, uint32_t fwdgt_clock_source);
/* configure the linflexd clock source selection */
void rcu_linflexd_clock_config(uint32_t linflexd_clock_source, uint32_t linflexddiv);

/* configure the AIT clock source selection */
void rcu_ait_clock_config(uint32_t ait_clock_source);
/* configure the ATE clock source selection */
void rcu_ate_clock_config(uint32_t ate_clock_source);
/* configure the TRACE clock source selection */
void rcu_trace_clock_source_config(uint32_t trace_clock_source, uint32_t trace_clock_psc);
/* configure the QSPI clock source selection */
void rcu_qspi_clock_source_config(uint32_t qspi_clock_source);

/* LXTAL, IRC48M, PLL and other oscillator configure functions */
/* configure the LXTAL drive capability */
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap);
/* wait for oscillator stabilization flags is SET or oscillator startup is timeout */
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci);
/* turn on the oscillator */
void rcu_osci_on(rcu_osci_type_enum osci);
/* turn off the oscillator */
void rcu_osci_off(rcu_osci_type_enum osci);
/* enable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it */
void rcu_osci_bypass_mode_enable(rcu_osci_type_enum osci);
/* disable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it */
void rcu_osci_bypass_mode_disable(rcu_osci_type_enum osci);
/* configure the HXTAL frequency scale select */
void rcu_hxtal_frequency_scale_select(uint32_t hxtal_scal);
/* configure the HXTAL or IRC48M divider used as input of PLL */
void rcu_prediv_config(uint32_t prediv);
/* set the IRC48M adjust value */
void rcu_irc48m_adjust_value_set(uint32_t irc48m_adjval);
/* configure the IRC48M fail response */
void rcu_irc48m_fail_response_config(uint32_t irc48m_fail);

/* clock monitor configure functions */
/* enable the HXTAL clock monitor */
void rcu_hxtal_clock_monitor_enable(void);
/* disable the HXTAL clock monitor */
void rcu_hxtal_clock_monitor_disable(void);
/* frequency monitor enable */
void rcu_frequency_monitor_enable(uint32_t ckfmx);
/* frequency monitor disable */
void rcu_frequency_monitor_disable(uint32_t ckfmx);
/* frequency monitor0 system reset enable */
void rcu_frequency_monitor0_system_reset_enable(uint32_t sys_rst);
/* frequency monitor0 system reset disable */
void rcu_frequency_monitor0_system_reset_disable( uint32_t sys_rst);
/* frequency monitor system reset enable */
void rcu_frequency_monitor_system_reset_enable(uint32_t ckfmx, uint32_t interrupt);
/* frequency monitor system reset disable */
void rcu_frequency_monitor_system_reset_disable(uint32_t ckfmx, uint32_t interrupt);
/* frequency monitor interrupt enable */
void rcu_frequency_monitor_interrupt_enable(uint32_t ckfmx,uint32_t interrupt);
/* frequency monitor interrupt disable */
void rcu_frequency_monitor_interrupt_disable(uint32_t ckfmx,uint32_t interrupt);
/* get frequency monitor flag */
FlagStatus rcu_frequency_monitor_flag_get(uint32_t ckfmx,uint32_t interrupt_flag);
/* clear frequency monitor flag */
void rcu_frequency_monitor_flag_clear(uint32_t ckfmx,uint32_t interrupt_flag);
/* reference count configuration */
void rcu_reference_count_config(uint32_t ckfmx, uint32_t count);
/* high threshold configuration */
void rcu_monitored_hthreshold_config(uint32_t ckfmx, uint32_t hthreshold);
/* low threshold configuration */
void rcu_monitored_lthreshold_config(uint32_t ckfmx, uint32_t lthreshold);
/* frequency detect enable */
void rcu_frequency_detect_enable(ckd_enum ckdx);
/* frequency detect disable */
void rcu_frequency_detect_disable(ckd_enum ckdx);
/* frequency detect interrupt enable */
void rcu_frequency_detect_error_interrupt_enable(ckd_enum ckdx);
/* frequency detect interrupt disable */
void rcu_frequency_detect_error_interrupt_disable(ckd_enum ckdx);
/* clock frequency get functions */
/* get the system clock, bus and peripheral clock frequency */
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock);


/* system/subsystem reset flag  */
/* clear the system reset flag */
void rcu_system_reset_flag_clear(uint32_t sysrst_flag);
/* clear the sub system reset flag */
void rcu_subsystem_reset_flag_clear(uint32_t subsysrst_flag);
/* get the system reset flag */
FlagStatus rcu_system_reset_flag_get(uint32_t sysrst_flag);
/* get the sub system reset flag */
FlagStatus rcu_subsystem_reset_flag_get(uint32_t subsysrst_flag);
/* get subsystem reset upgrade counter */
uint32_t rcu_subsystem_reset_upgrade_counter_get(void);
/* get system reset upgrade counter */
uint32_t rcu_system_reset_upgrade_counter_get(void);
/* get subsystem reset counter */
uint32_t rcu_subsystem_reset_counter_get(void);
/* get system reset counter*/
uint32_t rcu_system_reset_counter_get(void);
/* clear subsystem reset upgrade counter */
void rcu_subsystem_reset_upgrade_counter_clear(void);
/* clear subsystem reset counter */
void rcu_subsystem_reset_counter_clear(void);
/* clear system reset counter */
void rcu_system_reset_counter_clear(void);
/* config system reset upgrade threshold */
void rcu_system_reset_upgrade_threshold_config(uint32_t upgrade_threshold);
/* config subsystem reset upgrade threshold */
void rcu_subsystem_reset_upgrade_threshold_config(uint32_t upgrade_threshold);
/* enable bus access during SUBSRST1 stage */
void rcu_subsystem_reset_bus_access_enable(void);
/* disable bus access during SUBSRST1 stage */
void rcu_subsystem_reset_bus_access_disable(void);
/* enable external reset pin assert.NOTE: this API must use only as part of the mainreset domain self-test entry procedure */
void rcu_external_reset_pin_assert_enable(void);
/* disable external reset pin assert */
void rcu_external_reset_pin_assert_disable(void);
/* config subsystem reset timer value */
void rcu_subsystem_reset_timeout_config(uint32_t timeout);
/* enable subsystem reset entry timer */
void rcu_subsystem_reset_entry_timer_enable(void);
/* disable subsystem reset entry timer */
void rcu_subsystem_reset_entry_timer_disable(void);
/* enable subsystem reset request */
ErrStatus rcu_all_subsystem_reset_request_enable(void);
/* disable subsystem reset request */
ErrStatus rcu_all_subsystem_reset_request_disable(void);
/* get the standby reset flags */
FlagStatus rcu_standby_reset_flag_get(uint32_t flag);
/* clear the standby reset flags */
void rcu_standby_reset_flag_clear(uint32_t flag);
/* get the low power debug flag */
FlagStatus rcu_low_power_debug_flag_get(void);
/* get the por watchdog overflow flags */
FlagStatus rcu_por_watchdog_overflow_flag_get(por_watchdog_overflow_flag_enum flag);
/* clear the por watchdog overflow flags */
void rcu_por_watchdog_overflow_flag_clear(por_watchdog_overflow_flag_enum flag);

/* flag & interrupt functions */
/* get the clock stabilization and peripheral reset flags */
FlagStatus rcu_flag_get(rcu_flag_enum flag);
/* get the clock stabilization interrupt and ckm flags */
FlagStatus rcu_interrupt_flag_get(rcu_int_flag_enum int_flag);
/* clear the interrupt flags */
void rcu_interrupt_flag_clear(rcu_int_flag_clear_enum int_flag);
/* enable the stabilization interrupt */
void rcu_interrupt_enable(rcu_int_enum interrupt);
/* disable the stabilization interrupt */
void rcu_interrupt_disable(rcu_int_enum interrupt);

