sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.h
/*TMR function*/
/* enable the RCTL TMR */
void rcu_rctl_tmr_enable(uint32_t rctl_tmr);
/* disable the RCTL TMR */
void rcu_rctl_tmr_disable(uint32_t rctl_tmr);
/* enable the CCTL TMR */
void rcu_cctl_tmr_enable(uint32_t cctl_tmr);
/* disable the CCTL TMR */
void rcu_cctl_tmr_disable(uint32_t cctl_tmr);
/* get the RCTL TMR flag */
FlagStatus rcu_rctl_tmr_flag_get(uint32_t rctl_tmr_flag);
/* clear the RCTL TMR flag */
void rcu_rctl_tmr_flag_clear(uint32_t rctl_tmr_flag);
/* get the CCTL TMR flag */
FlagStatus rcu_cctl_tmr_flag_get(uint32_t cctl_tmr_flag);
/* clear the CCTL TMR flag */
void rcu_cctl_tmr_flag_clear(uint32_t cctl_tmr_flag);

/*PLL function*/
/* adjust the PLL loss of lock accuracy */
void rcu_pll_loss_of_lock_config(uint32_t lol_accuracy);
/* get the loss of lock detector flag */
FlagStatus rcu_pll_loss_of_lock_flag_get(void);
/* clear the loss of lock detector flag */
void rcu_pll_loss_of_lock_flag_clear(void);
/* config fractional part of the multiplication factor for PLL VCO */
void rcu_pll_fractional_config(uint32_t pll_fractional);
/* enable PLL fractional latch */
void rcu_pll_fractional_latch_enable(void);
/* disable PLL fractional latch */
void rcu_pll_fractional_latch_disable(void);
/* configure the spread spectrum modulation for the main PLL clock */
void rcu_spread_spectrum_config(uint32_t spread_spectrum_type, uint32_t modstep, uint32_t modcnt);
/* enable the PLL spread spectrum modulation */
void rcu_spread_spectrum_enable(void);
/* disable the PLL spread spectrum modulation */
void rcu_spread_spectrum_disable(void);
/* config subsystem reset */
void rcu_subsystem_reset_config(uint32_t subsysrsrt, ControlStatus reset_config);
/* config subsystem reset pin assertion */
void rcu_subsystem_reset_pin_assertion_config(uint32_t subsysrsrt, ControlStatus reset_pin_assert);
#endif /* GD32A7XX_RCU_H */
